[
    {
      "ot_ref": "Genesis 3:15",
      "ot_prophecy": "And I will put enmity between you and the woman, and between your offspring and hers; he will crush your head, and you will strike his heel.",
      "nt_ref": "Galatians 4:4, Hebrews 2:14, 1 John 3:8",
      "nt_fulfillment": "But when the fullness of the time came, God sent forth His Son, born of a woman... Since the children share in flesh and blood, He Himself likewise also partook of the same, that through death He might render powerless him who had the power of death, that is, the devil... The reason the Son of God appeared was to destroy the works of the devil."
    },
    {
      "ot_ref": "Genesis 12:3",
      "ot_prophecy": "I will bless those who bless you, and whoever curses you I will curse; and all peoples on earth will be blessed through you.",
      "nt_ref": "Acts 3:25-26, Galatians 3:8",
      "nt_fulfillment": "And you are heirs of the prophets and of the covenant God made with your fathers. He said to Abraham, ‘Through your offspring all peoples on earth will be blessed.’ When God raised up his servant, he sent him first to you to bless you by turning each of you from your wicked ways... Scripture foresaw that God would justify the Gentiles by faith, and announced the gospel in advance to Abraham: “All nations will be blessed through you.”"
    },
    {
      "ot_ref": "Genesis 14:18",
      "ot_prophecy": "Then Melchizedek king of Salem brought out bread and wine. He was priest of God Most High,",
      "nt_ref": "Hebrews 5:6, 6:20, 7:1-3",
      "nt_fulfillment": "And he says in another place, “You are a priest forever, in the order of Melchizedek.” ...where Jesus, who went before us, has entered on our behalf. He has become a high priest forever, in the order of Melchizedek... This Melchizedek was king of Salem and priest of God Most High..."
    },
    {
      "ot_ref": "Genesis 17:19",
      "ot_prophecy": "Then God said, “Yes, but your wife Sarah will bear you a son, and you will call him Isaac. I will establish my covenant with him as an everlasting covenant for his descendants after him.\"",
      "nt_ref": "Matthew 1:2, Romans 9:7",
      "nt_fulfillment": "Abraham was the father of Isaac, Isaac the father of Jacob... Nor because they are his descendants are they all Abraham’s children. On the contrary, “It is through Isaac that your offspring will be reckoned.”"
    },
    {
      "ot_ref": "Genesis 22:8",
      "ot_prophecy": "Abraham answered, “God himself will provide the lamb for the burnt offering, my son.” And the two of them went on together.",
      "nt_ref": "John 1:29",
      "nt_fulfillment": "The next day John saw Jesus coming toward him and said, “Look, the Lamb of God, who takes away the sin of the world!\""
    },
    {
      "ot_ref": "Genesis 22:18",
      "ot_prophecy": "and through your offspring all nations on earth will be blessed, because you have obeyed me.",
      "nt_ref": "Galatians 3:16",
      "nt_fulfillment": "The promises were spoken to Abraham and to his seed. Scripture does not say “and to seeds,” meaning many people, but “and to your seed,” meaning one person, who is Christ."
    },
    {
      "ot_ref": "Genesis 28:14",
      "ot_prophecy": "Your descendants will be like the dust of the earth, and you will spread out to the west and to the east, to the north and to the south. All peoples on earth will be blessed through you and your offspring.",
      "nt_ref": "Luke 3:34, Galatians 3:16",
      "nt_fulfillment": "...the son of Jacob, the son of Isaac, the son of Abraham... The promises were spoken to Abraham and to his seed... meaning one person, who is Christ."
    },
    {
      "ot_ref": "Genesis 49:10",
      "ot_prophecy": "The scepter will not depart from Judah, nor the ruler’s staff from between his feet, until he to whom it belongs shall come and the obedience of the nations shall be his.",
      "nt_ref": "Luke 3:33, John 1:49",
      "nt_fulfillment": "...the son of Hezron, the son of Perez, the son of Judah... Then Nathanael declared, “Rabbi, you are the Son of God; you are the king of Israel.”"
    },
    {
      "ot_ref": "Exodus 12:5, 7",
      "ot_prophecy": "The animals you choose must be year-old males without defect... Then they are to take some of the blood and put it on the sides and tops of the doorframes of the houses where they eat the lambs.",
      "nt_ref": "1 Peter 1:19, Hebrews 9:14",
      "nt_fulfillment": "...but with the precious blood of Christ, a lamb without blemish or defect... How much more, then, will the blood of Christ, who through the eternal Spirit offered himself unblemished to God, cleanse our consciences from acts that lead to death, so that we may serve the living God!"
    },
    {
      "ot_ref": "Exodus 12:13",
      "ot_prophecy": "The blood will be a sign for you on the houses where you are, and when I see the blood, I will pass over you. No destructive plague will touch you when I strike Egypt.",
      "nt_ref": "Romans 5:8-9, 1 Corinthians 5:7",
      "nt_fulfillment": "But God demonstrates his own love for us in this: While we were still sinners, Christ died for us. Since we have now been justified by his blood, how much more shall we be saved from God’s wrath through him!... For Christ, our Passover lamb, has been sacrificed."
    },
    {
      "ot_ref": "Exodus 12:46",
      "ot_prophecy": "It must be eaten inside the house; take none of the meat outside the house. Do not break any of the bones.",
      "nt_ref": "John 19:33, 36",
      "nt_fulfillment": "But when they came to Jesus and found that he was already dead, they did not break his legs... These things happened so that the scripture would be fulfilled: “Not one of his bones will be broken,”"
    },
    {
      "ot_ref": "Exodus 17:6",
      "ot_prophecy": "I will stand there before you by the rock at Horeb. Strike the rock, and water will come out of it for the people to drink.” So Moses did this in the sight of the elders of Israel.",
      "nt_ref": "1 Corinthians 10:4, John 4:13-14",
      "nt_fulfillment": "...and drank the same spiritual drink; for they drank from the spiritual rock that accompanied them, and that rock was Christ... Jesus answered, “Everyone who drinks this water will be thirsty again, but whoever drinks the water I give them will never thirst. Indeed, the water I give them will become in them a spring of water welling up to eternal life.”"
    },
    {
      "ot_ref": "Leviticus 16:27",
      "ot_prophecy": "The bull and the goat for the sin offerings, whose blood was brought into the Most Holy Place to make atonement, are to be taken outside the camp; their hides, flesh and intestines are to be burned up.",
      "nt_ref": "Hebrews 13:11-12",
      "nt_fulfillment": "The high priest carries the blood of animals into the Most Holy Place as a sin offering, but the bodies are burned outside the camp. And so Jesus also suffered outside the city gate to make the people holy through his own blood."
    },
    {
      "ot_ref": "Leviticus 17:11",
      "ot_prophecy": "For the life of a creature is in the blood, and I have given it to you to make atonement for yourselves on the altar; it is the blood that makes atonement for one’s life.",
      "nt_ref": "Matthew 26:28, 1 John 1:7",
      "nt_fulfillment": "This is my blood of the covenant, which is poured out for many for the forgiveness of sins... But if we walk in the light, as he is in the light, we have fellowship with one another, and the blood of Jesus, his Son, purifies us from all sin."
    },
    {
      "ot_ref": "Numbers 9:12",
      "ot_prophecy": "They must not leave any of it till morning or break any of its bones. When they celebrate the Passover, they must follow all the regulations.",
      "nt_ref": "John 19:33, 36",
      "nt_fulfillment": "But when they came to Jesus and found that he was already dead, they did not break his legs... These things happened so that the scripture would be fulfilled: “Not one of his bones will be broken,”"
    },
    {
      "ot_ref": "Numbers 21:9",
      "ot_prophecy": "So Moses made a bronze snake and put it up on a pole. Then when anyone was bitten by a snake and looked at the bronze snake, they lived.",
      "nt_ref": "John 3:14-15",
      "nt_fulfillment": "Just as Moses lifted up the snake in the wilderness, so the Son of Man must be lifted up, that everyone who believes may have eternal life in him.”"
    },
    {
      "ot_ref": "Numbers 24:17",
      "ot_prophecy": "I see him, but not now; I behold him, but not near. A star will come out of Jacob; a scepter will rise out of Israel.",
      "nt_ref": "Matthew 2:1-2, Revelation 22:16",
      "nt_fulfillment": "After Jesus was born in Bethlehem in Judea... Magi from the east came to Jerusalem and asked, “Where is the one who has been born king of the Jews? We saw his star when it rose and have come to worship him.”... “I, Jesus, have sent my angel to give you this testimony for the churches. I am the Root and the Offspring of David, and the bright Morning Star.”"
    },
    {
      "ot_ref": "Deuteronomy 18:15",
      "ot_prophecy": "The LORD your God will raise up for you a prophet like me from among you, from your fellow Israelites. You must listen to him.",
      "nt_ref": "John 6:14, Acts 3:22",
      "nt_fulfillment": "After the people saw the sign Jesus performed, they began to say, “Surely this is the Prophet who is to come into the world.” ... For Moses said, ‘The Lord your God will raise up for you a prophet like me from among your own people; you must listen to everything he tells you.'"
    },
    {
      "ot_ref": "Deuteronomy 18:18-19",
      "ot_prophecy": "I will raise up for them a prophet like you from among their fellow Israelites, and I will put my words in his mouth. He will tell them everything I command him. I myself will call to account anyone who does not listen to my words that the prophet speaks in my name.",
      "nt_ref": "John 12:49-50, Acts 3:23",
      "nt_fulfillment": "For I did not speak on my own, but the Father who sent me commanded me to say all that I have spoken. I know that his command leads to eternal life. So whatever I say is just what the Father has told me to say.” ... Anyone who does not listen to him will be completely cut off from their people.’"
    },
    {
      "ot_ref": "Deuteronomy 21:23",
      "ot_prophecy": "you must not leave the body hanging on the pole overnight. Be sure to bury it that same day, because anyone who is hung on a pole is under God’s curse. You must not desecrate the land the LORD your God is giving you as an inheritance.",
      "nt_ref": "Galatians 3:13",
      "nt_fulfillment": "Christ redeemed us from the curse of the law by becoming a curse for us, for it is written: “Cursed is everyone who is hung on a pole.”"
    },
    {
      "ot_ref": "Ruth 4:4-10",
      "ot_prophecy": "(Story of Boaz, the kinsman-redeemer)",
      "nt_ref": "Ephesians 1:7, Matthew 1:5",
      "nt_fulfillment": "In him we have redemption through his blood, the forgiveness of sins, in accordance with the riches of God’s grace... Salmon the father of Boaz, whose mother was Rahab, Boaz the father of Obed, whose mother was Ruth..."
    },
    {
      "ot_ref": "2 Samuel 7:12-13",
      "ot_prophecy": "When your days are over and you rest with your ancestors, I will raise up your offspring to succeed you, your own flesh and blood, and I will establish his kingdom. He is the one who will build a house for my Name, and I will establish the throne of his kingdom forever.",
      "nt_ref": "Luke 1:32-33",
      "nt_fulfillment": "He will be great and will be called the Son of the Most High. The Lord God will give him the throne of his father David, and he will reign over Jacob’s descendants forever; his kingdom will never end.”"
    },
    {
      "ot_ref": "2 Samuel 7:14a",
      "ot_prophecy": "I will be his father, and he shall be my son.",
      "nt_ref": "Luke 1:32, Romans 1:3-4, Hebrews 1:5",
      "nt_fulfillment": "He will be great and will be called the Son of the Most High... regarding his Son, who as to his earthly life was a descendant of David, and who through the Spirit of holiness was appointed the Son of God in power by his resurrection from the dead: Jesus Christ our Lord... For to which of the angels did God ever say, “You are my Son; today I have become your Father”?"
    },
    {
      "ot_ref": "1 Chronicles 17:11-14",
      "ot_prophecy": "When your days are over and you go to be with your ancestors, I will raise up your offspring to succeed you, one of your own sons, and I will establish his kingdom. He is the one who will build a house for me, and I will establish his throne forever. I will be his father, and he will be my son... I will set him over my house and my kingdom forever; his throne will be established forever.’",
      "nt_ref": "Luke 1:32-33",
      "nt_fulfillment": "He will be great and will be called the Son of the Most High. The Lord God will give him the throne of his father David, and he will reign over Jacob’s descendants forever; his kingdom will never end.”"
    },
    {
      "ot_ref": "Job 19:25-27",
      "ot_prophecy": "I know that my redeemer lives, and that in the end he will stand on the earth. And after my skin has been destroyed, yet in my flesh I will see God; I myself will see him with my own eyes—I, and not another. How my heart yearns within me!",
      "nt_ref": "John 5:24-29, 1 Thessalonians 4:16",
      "nt_fulfillment": "Very truly I tell you, whoever hears my word and believes him who sent me has eternal life and will not be judged but has crossed over from death to life... a time is coming and has now come when the dead will hear the voice of the Son of God and those who hear will live... For the Lord himself will come down from heaven, with a loud command, with the voice of the archangel and with the trumpet call of God, and the dead in Christ will rise first."
    },
    {
      "ot_ref": "Psalm 2:1-2",
      "ot_prophecy": "Why do the nations conspire and the peoples plot in vain? The kings of the earth rise up and the rulers band together against the LORD and against his anointed one.",
      "nt_ref": "Acts 4:25-28",
      "nt_fulfillment": "You spoke by the Holy Spirit through the mouth of your servant, our father David: ‘Why do the nations rage and the peoples plot in vain? The kings of the earth rise up and the rulers band together against the Lord and against his anointed one.’ Indeed Herod and Pontius Pilate met together with the Gentiles and the people of Israel in this city to conspire against your holy servant Jesus, whom you anointed. They did what your power and will had decided beforehand should happen."
    },
    {
      "ot_ref": "Psalm 2:6",
      "ot_prophecy": "I have installed my king on Zion, my holy mountain.",
      "nt_ref": "Matthew 2:2, John 18:37",
      "nt_fulfillment": "and asked, “Where is the one who has been born king of the Jews? We saw his star when it rose and have come to worship him.” ... “You say that I am a king. In fact, the reason I was born and came into the world is to testify to the truth. Everyone on the side of truth listens to me.”"
    },
    {
      "ot_ref": "Psalm 2:7",
      "ot_prophecy": "I will proclaim the LORD’s decree: He said to me, “You are my son; today I have become your father.\"",
      "nt_ref": "Matthew 3:17, Acts 13:33, Hebrews 1:5",
      "nt_fulfillment": "And a voice from heaven said, “This is my Son, whom I love; with him I am well pleased.” ... As it is written in the second Psalm: ‘You are my son; today I have become your father.’ ... For to which of the angels did God ever say, “You are my Son; today I have become your Father”?"
    },
    {
      "ot_ref": "Psalm 8:2",
      "ot_prophecy": "Through the praise of children and infants you have established a stronghold against your enemies, to silence the foe and the avenger.",
      "nt_ref": "Matthew 21:15-16",
      "nt_fulfillment": "But when the chief priests and the teachers of the law saw the wonderful things he did and the children shouting in the temple courts, “Hosanna to the Son of David,” they were indignant. “Do you hear what these children are saying?” they asked him. “Yes,” replied Jesus, “have you never read, ‘From the lips of children and infants you, Lord, have called forth your praise’?”"
    },
    {
      "ot_ref": "Psalm 16:10",
      "ot_prophecy": "because you will not abandon me to the realm of the dead, nor will you let your faithful one see decay.",
      "nt_ref": "Acts 2:27, 31",
      "nt_fulfillment": "because you will not abandon me to the realm of the dead, you will not let your holy one see decay.’ ... Seeing what was to come, he spoke of the resurrection of the Messiah, that he was not abandoned to the realm of the dead, nor did his body see decay."
    },
    {
      "ot_ref": "Psalm 22:1",
      "ot_prophecy": "My God, my God, why have you forsaken me? Why are you so far from saving me, so far from my cries of anguish?",
      "nt_ref": "Matthew 27:46",
      "nt_fulfillment": "About three in the afternoon Jesus cried out in a loud voice, “Eli, Eli, lema sabachthani?” (which means “My God, my God, why have you forsaken me?”)."
    },
    {
      "ot_ref": "Psalm 22:7-8",
      "ot_prophecy": "All who see me mock me; they hurl insults, shaking their heads: “He trusts in the LORD,” they say, “let the LORD rescue him. Let him deliver him, since he delights in him.”",
      "nt_ref": "Matthew 27:39, 43",
      "nt_fulfillment": "Those who passed by hurled insults at him, shaking their heads... He trusts in God. Let God rescue him now if he wants him, for he said, ‘I am the Son of God.’”"
    },
    {
      "ot_ref": "Psalm 22:14-15",
      "ot_prophecy": "I am poured out like water, and all my bones are out of joint. My heart has turned to wax; it has melted within me. My mouth is dried up like a potsherd, and my tongue sticks to the roof of my mouth; you lay me in the dust of death.",
      "nt_ref": "John 19:28, 34",
      "nt_fulfillment": "Later, knowing that everything had now been finished, and so that Scripture would be fulfilled, Jesus said, “I am thirsty.” ... Instead, one of the soldiers pierced Jesus’ side with a spear, bringing a sudden flow of blood and water."
    },
    {
      "ot_ref": "Psalm 22:16",
      "ot_prophecy": "Dogs surround me, a pack of villains encircles me; they pierce my hands and my feet.",
      "nt_ref": "John 19:18, 20:25-27",
      "nt_fulfillment": "There they crucified him... Unless I see the nail marks in his hands... Put your finger here; see my hands... Stop doubting and believe."
    },
    {
      "ot_ref": "Psalm 22:18",
      "ot_prophecy": "They divide my clothes among them and cast lots for my garment.",
      "nt_ref": "John 19:23-24",
      "nt_fulfillment": "When the soldiers crucified Jesus, they took his clothes... “Let’s not tear it,”... “Let’s decide by lot who will get it.” This happened that the scripture might be fulfilled..."
    },
    {
      "ot_ref": "Psalm 31:5",
      "ot_prophecy": "Into your hands I commit my spirit; deliver me, LORD, my faithful God.",
      "nt_ref": "Luke 23:46",
      "nt_fulfillment": "Jesus called out with a loud voice, “Father, into your hands I commit my spirit.” When he had said this, he breathed his last."
    },
    {
      "ot_ref": "Psalm 34:20",
      "ot_prophecy": "he protects all his bones, not one of them will be broken.",
      "nt_ref": "John 19:33, 36",
      "nt_fulfillment": "But when they came to Jesus and found that he was already dead, they did not break his legs... These things happened so that the scripture would be fulfilled: “Not one of his bones will be broken,”"
    },
    {
      "ot_ref": "Psalm 35:11",
      "ot_prophecy": "Ruthless witnesses come forward; they question me on things I know nothing about.",
      "nt_ref": "Mark 14:57-58",
      "nt_fulfillment": "Then some stood up and gave this false testimony against him: “We heard him say, ‘I will destroy this temple made with human hands and in three days will build another, not made with hands.’”"
    },
    {
      "ot_ref": "Psalm 35:19",
      "ot_prophecy": "Do not let those gloat over me who are my enemies without cause; do not let those who hate me without reason maliciously wink the eye.",
      "nt_ref": "John 15:25",
      "nt_fulfillment": "But this is to fulfill what is written in their Law: ‘They hated me without reason.’"
    },
    {
      "ot_ref": "Psalm 40:7-8",
      "ot_prophecy": "Then I said, “Here I am, I have come— it is written about me in the scroll. I desire to do your will, my God; your law is within my heart.”",
      "nt_ref": "Hebrews 10:5, 7",
      "nt_fulfillment": "Therefore, when Christ came into the world, he said: “Sacrifice and offering you did not desire, but a body you prepared for me;... Then I said, ‘Here I am—it is written about me in the scroll— I have come to do your will, my God.’”"
    },
    {
      "ot_ref": "Psalm 41:9",
      "ot_prophecy": "Even my close friend, someone I trusted, one who shared my bread, has turned against me.",
      "nt_ref": "John 13:18",
      "nt_fulfillment": "“I am not referring to all of you; I know those I have chosen. But this is to fulfill this passage of Scripture: ‘He who shared my bread has turned against me.’"
    },
    {
      "ot_ref": "Psalm 45:6-7",
      "ot_prophecy": "Your throne, O God, will last for ever and ever; a scepter of justice will be the scepter of your kingdom. You love righteousness and hate wickedness; therefore God, your God, has set you above your companions by anointing you with the oil of joy.",
      "nt_ref": "Hebrews 1:8-9",
      "nt_fulfillment": "But about the Son he says, “Your throne, O God, will last for ever and ever; a scepter of justice will be the scepter of your kingdom. You have loved righteousness and hated wickedness; therefore God, your God, has set you above your companions by anointing you with the oil of joy.”"
    },
    {
      "ot_ref": "Psalm 68:18",
      "ot_prophecy": "When you ascended on high, you took many captives; you received gifts from people, even from the rebellious— that you, LORD God, might dwell there.",
      "nt_ref": "Acts 1:9-11, Ephesians 4:8",
      "nt_fulfillment": "After he said this, he was taken up before their very eyes, and a cloud hid him from their sight... This is why it says: “When he ascended on high, he took many captives and gave gifts to his people.”"
    },
    {
      "ot_ref": "Psalm 69:4",
      "ot_prophecy": "Those who hate me without reason outnumber the hairs of my head; many are my enemies without cause, those who seek to destroy me.",
      "nt_ref": "John 15:25",
      "nt_fulfillment": "But this is to fulfill what is written in their Law: ‘They hated me without reason.’"
    },
    {
      "ot_ref": "Psalm 69:9",
      "ot_prophecy": "for zeal for your house consumes me, and the insults of those who insult you fall on me.",
      "nt_ref": "John 2:17, Romans 15:3",
      "nt_fulfillment": "His disciples remembered that it is written: “Zeal for your house will consume me.” ... For even Christ did not please himself but, as it is written: “The insults of those who insult you have fallen on me.”"
    },
    {
      "ot_ref": "Psalm 69:21",
      "ot_prophecy": "They put gall in my food and gave me vinegar for my thirst.",
      "nt_ref": "Matthew 27:34, 48",
      "nt_fulfillment": "There they offered Jesus wine to drink, mixed with gall; but after tasting it, he refused to drink it... Immediately one of them ran and got a sponge. He filled it with wine vinegar..."
    },
    {
      "ot_ref": "Psalm 78:2",
      "ot_prophecy": "I will open my mouth with a parable; I will utter hidden things, things from of old—",
      "nt_ref": "Matthew 13:34-35",
      "nt_fulfillment": "Jesus spoke all these things to the crowd in parables; he did not say anything to them without using a parable. So was fulfilled what was spoken through the prophet: “I will open my mouth in parables, I will utter things hidden since the creation of the world.”"
    },
    {
      "ot_ref": "Psalm 89:3-4",
      "ot_prophecy": "You said, “I have made a covenant with my chosen one, I have sworn to David my servant, ‘I will establish your line forever and make your throne firm through all generations.’”",
      "nt_ref": "Luke 1:32-33, Acts 2:30",
      "nt_fulfillment": "He will be great... The Lord God will give him the throne of his father David, and he will reign... forever... But he was a prophet and knew that God had promised him on oath that he would place one of his descendants on his throne."
    },
    {
      "ot_ref": "Psalm 109:4",
      "ot_prophecy": "In return for my friendship they accuse me, but I am a man of prayer.",
      "nt_ref": "Luke 23:34",
      "nt_fulfillment": "Jesus said, “Father, forgive them, for they do not know what they are doing.” And they divided up his clothes by casting lots."
    },
    {
      "ot_ref": "Psalm 109:8",
      "ot_prophecy": "May his days be few; may another take his place of leadership.",
      "nt_ref": "Acts 1:20",
      "nt_fulfillment": "“For,” said Peter, “it is written in the Book of Psalms: ‘May his place be deserted; let there be no one to dwell in it,’ and, ‘May another take his place of leadership.’”"
    },
    {
      "ot_ref": "Psalm 110:1",
      "ot_prophecy": "The LORD says to my lord: “Sit at my right hand until I make your enemies a footstool for your feet.”",
      "nt_ref": "Matthew 22:44, Acts 2:34",
      "nt_fulfillment": "‘The Lord said to my Lord: “Sit at my right hand until I put your enemies under your feet.”’... For David did not ascend to heaven, and yet he said, ‘The Lord said to my Lord: “Sit at my right hand...'"
    },
    {
      "ot_ref": "Psalm 110:4",
      "ot_prophecy": "The LORD has sworn and will not change his mind: “You are a priest forever, in the order of Melchizedek.”",
      "nt_ref": "Hebrews 5:5-6, 6:20",
      "nt_fulfillment": "In the same way, Christ did not take on himself the glory of becoming a high priest. But God said to him, “You are my Son; today I have become your Father.” And he says in another place, “You are a priest forever, in the order of Melchizedek.” ...where Jesus, who went before us, has entered on our behalf. He has become a high priest forever, in the order of Melchizedek."
    },
    {
      "ot_ref": "Psalm 118:22-23",
      "ot_prophecy": "The stone the builders rejected has become the cornerstone; the LORD has done this, and it is marvelous in our eyes.",
      "nt_ref": "Matthew 21:42, Acts 4:10-11",
      "nt_fulfillment": "Jesus said to them, “Have you never read in the Scriptures: ‘The stone the builders rejected has become the cornerstone; the Lord has done this, and it is marvelous in our eyes’?” ...then know this, you and all the people of Israel: It is by the name of Jesus Christ of Nazareth, whom you crucified but whom God raised from the dead, that this man stands before you healed. Jesus is ‘the stone you builders rejected, which has become the cornerstone.’"
    },
    {
      "ot_ref": "Psalm 118:26",
      "ot_prophecy": "Blessed is he who comes in the name of the LORD. From the house of the LORD we bless you.",
      "nt_ref": "Matthew 21:9",
      "nt_fulfillment": "The crowds that went ahead of him and those that followed shouted, “Hosanna to the Son of David!” “Blessed is he who comes in the name of the Lord!” “Hosanna in the highest heaven!”"
    },
    {
      "ot_ref": "Isaiah 7:14",
      "ot_prophecy": "Therefore the Lord himself will give you a sign: The virgin will conceive and give birth to a son, and will call him Immanuel.",
      "nt_ref": "Matthew 1:22-23",
      "nt_fulfillment": "All this took place to fulfill what the Lord had said through the prophet: “The virgin will conceive and give birth to a son, and they will call him Immanuel” (which means “God with us”)."
    },
    {
      "ot_ref": "Isaiah 9:1-2",
      "ot_prophecy": "Nevertheless, there will be no more gloom for those who were in distress... In the future he will honor Galilee of the nations... The people walking in darkness have seen a great light; on those living in the land of deep darkness a light has dawned.",
      "nt_ref": "Matthew 4:13-16",
      "nt_fulfillment": "leaving Nazareth, he went and lived in Capernaum... in the area of Zebulun and Naphtali— to fulfill what was said through the prophet Isaiah: “Land of Zebulun and land of Naphtali... Galilee of the Gentiles— the people living in darkness have seen a great light; on those living in the land of the shadow of death a light has dawned.”"
    },
    {
      "ot_ref": "Isaiah 9:6",
      "ot_prophecy": "For to us a child is born, to us a son is given, and the government will be on his shoulders. And he will be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.",
      "nt_ref": "Luke 2:11, Matthew 28:18, John 3:16",
      "nt_fulfillment": "Today in the town of David a Savior has been born to you; he is the Messiah, the Lord... Then Jesus came to them and said, “All authority in heaven and on earth has been given to me.”... For God so loved the world that he gave his one and only Son..."
    },
    {
      "ot_ref": "Isaiah 9:7",
      "ot_prophecy": "Of the greatness of his government and peace there will be no end. He will reign on David’s throne and over his kingdom, establishing and upholding it with justice and righteousness from that time on and forever.",
      "nt_ref": "Luke 1:32-33",
      "nt_fulfillment": "He will be great and will be called the Son of the Most High. The Lord God will give him the throne of his father David, and he will reign over Jacob’s descendants forever; his kingdom will never end.”"
    },
    {
      "ot_ref": "Isaiah 11:1",
      "ot_prophecy": "A shoot will come up from the stump of Jesse; from his roots a Branch will bear fruit.",
      "nt_ref": "Matthew 1:1, 6, Luke 3:23, 31-32",
      "nt_fulfillment": "A record of the genealogy of Jesus Christ the son of David... and Jesse the father of King David... Now Jesus himself was about thirty years old when he began his ministry. He was the son, so it was thought, of Joseph, the son of Heli... the son of David, the son of Jesse..."
    },
    {
      "ot_ref": "Isaiah 11:2",
      "ot_prophecy": "The Spirit of the LORD will rest on him— the Spirit of wisdom and of understanding, the Spirit of counsel and of might, the Spirit of the knowledge and fear of the LORD—",
      "nt_ref": "Matthew 3:16-17, Luke 2:40, 52",
      "nt_fulfillment": "As soon as Jesus was baptized, he went up out of the water. At that moment heaven was opened, and he saw the Spirit of God descending like a dove and alighting on him. And a voice from heaven said, “This is my Son, whom I love; with him I am well pleased.”... And the child grew and became strong; he was filled with wisdom, and the grace of God was on him... And Jesus grew in wisdom and stature, and in favor with God and man."
    },
    {
      "ot_ref": "Isaiah 28:16",
      "ot_prophecy": "So this is what the Sovereign LORD says: “See, I lay a stone in Zion, a tested stone, a precious cornerstone for a sure foundation; the one who relies on it will never be stricken with panic.\"",
      "nt_ref": "Acts 4:11, Romans 9:33, 1 Peter 2:6",
      "nt_fulfillment": "Jesus is ‘the stone you builders rejected, which has become the cornerstone.’... As it is written: “See, I lay in Zion a stone that causes people to stumble and a rock that makes them fall, and the one who believes in him will never be put to shame.”... For in Scripture it says: “See, I lay a stone in Zion, a chosen and precious cornerstone, and the one who trusts in him will never be put to shame.”"
    },
    {
      "ot_ref": "Isaiah 29:13",
      "ot_prophecy": "The Lord says: “These people come near to me with their mouth and honor me with their lips, but their hearts are far from me. Their worship of me is based on merely human rules they have been taught.",
      "nt_ref": "Matthew 15:7-9",
      "nt_fulfillment": "You hypocrites! Isaiah was right when he prophesied about you: ‘These people honor me with their lips, but their hearts are far from me. They worship me in vain; their teachings are merely human rules.’”"
    },
    {
      "ot_ref": "Isaiah 35:5-6",
      "ot_prophecy": "Then will the eyes of the blind be opened and the ears of the deaf unstopped. Then will the lame leap like a deer, and the mute tongue shout for joy.",
      "nt_ref": "Matthew 11:4-5",
      "nt_fulfillment": "Jesus replied, “Go back and report to John what you hear and see: The blind receive sight, the lame walk, those who have leprosy are cleansed, the deaf hear, the dead are raised, and the good news is proclaimed to the poor.”"
    },
    {
      "ot_ref": "Isaiah 40:3",
      "ot_prophecy": "A voice of one calling: “In the wilderness prepare the way for the LORD; make straight in the desert a highway for our God.\"",
      "nt_ref": "Matthew 3:1-3",
      "nt_fulfillment": "In those days John the Baptist came, preaching in the wilderness of Judea and saying, “Repent, for the kingdom of heaven has come near.” This is he who was spoken of through the prophet Isaiah: “A voice of one calling in the wilderness, ‘Prepare the way for the Lord, make straight paths for him.’”"
    },
    {
      "ot_ref": "Isaiah 42:1-4",
      "ot_prophecy": "Here is my servant, whom I uphold, my chosen one in whom I delight; I will put my Spirit on him, and he will bring justice to the nations. He will not shout or cry out, or raise his voice in the streets. A bruised reed he will not break, and a smoldering wick he will not snuff out. In faithfulness he will bring forth justice; he will not falter or be discouraged till he establishes justice on earth.",
      "nt_ref": "Matthew 3:16-17, 12:17-21",
      "nt_fulfillment": "As soon as Jesus was baptized... he saw the Spirit of God descending like a dove... And a voice from heaven said, “This is my Son, whom I love; with him I am well pleased.” ... This was to fulfill what was spoken through the prophet Isaiah: “Here is my servant whom I have chosen, the one I love, in whom I delight; I will put my Spirit on him, and he will proclaim justice to the nations..."
    },
    {
      "ot_ref": "Isaiah 49:1",
      "ot_prophecy": "Listen to me, you islands; hear this, you distant nations: Before I was born the LORD called me; from my mother’s womb he has spoken my name.",
      "nt_ref": "Luke 1:30-31",
      "nt_fulfillment": "But the angel said to her, “Do not be afraid, Mary; you have found favor with God. You will conceive and give birth to a son, and you are to call him Jesus.”"
    },
    {
      "ot_ref": "Isaiah 49:6",
      "ot_prophecy": "he says: “It is too small a thing for you to be my servant to restore the tribes of Jacob and bring back those of Israel I have kept. I will also make you a light for the Gentiles, that my salvation may reach to the ends of the earth.”",
      "nt_ref": "Acts 13:47",
      "nt_fulfillment": "For this is what the Lord has commanded us: ‘I have made you a light for the Gentiles, that you may bring salvation to the ends of the earth.’”"
    },
    {
      "ot_ref": "Isaiah 50:6",
      "ot_prophecy": "I offered my back to those who beat me, my cheeks to those who pulled out my beard; I did not hide my face from mocking and spitting.",
      "nt_ref": "Matthew 26:67, 27:26, 30",
      "nt_fulfillment": "Then they spit in his face and struck him with their fists... Then he released Barabbas to them. But he had Jesus flogged... They spit on him, and took the staff and struck him on the head again and again."
    },
    {
      "ot_ref": "Isaiah 52:13",
      "ot_prophecy": "See, my servant will act wisely; he will be raised and lifted up and highly exalted.",
      "nt_ref": "Acts 1:9-11, Philippians 2:9",
      "nt_fulfillment": "After he said this, he was taken up before their very eyes... Therefore God exalted him to the highest place and gave him the name that is above every name,"
    },
    {
      "ot_ref": "Isaiah 52:14",
      "ot_prophecy": "Just as there were many who were appalled at him— his appearance was so disfigured beyond that of any human being and his form marred beyond human likeness—",
      "nt_ref": "Matthew 26:67, 27:30",
      "nt_fulfillment": "Then they spit in his face and struck him with their fists... They spit on him, and took the staff and struck him on the head again and again."
    },
    {
      "ot_ref": "Isaiah 53:3",
      "ot_prophecy": "He was despised and rejected by mankind, a man of suffering, and familiar with pain. Like one from whom people hide their faces he was despised, and we held him in low esteem.",
      "nt_ref": "John 1:11, Luke 23:18",
      "nt_fulfillment": "He came to that which was his own, but his own did not receive him... But the whole crowd shouted, “Away with this man! Release Barabbas to us!”"
    },
    {
      "ot_ref": "Isaiah 53:4",
      "ot_prophecy": "Surely he took up our pain and bore our suffering, yet we considered him punished by God, stricken by him, and afflicted.",
      "nt_ref": "Matthew 8:16-17",
      "nt_fulfillment": "When evening came, many who were demon-possessed were brought to him, and he drove out the spirits with a word and healed all the sick. This was to fulfill what was spoken through the prophet Isaiah: “He took up our infirmities and bore our diseases.”"
    },
    {
      "ot_ref": "Isaiah 53:5",
      "ot_prophecy": "But he was pierced for our transgressions, he was crushed for our iniquities; the punishment that brought us peace was on him, and by his wounds we are healed.",
      "nt_ref": "Romans 5:8, 1 Peter 2:24",
      "nt_fulfillment": "But God demonstrates his own love for us in this: While we were still sinners, Christ died for us... “He himself bore our sins” in his body on the cross, so that we might die to sins and live for righteousness; “by his wounds you have been healed.”"
    },
    {
      "ot_ref": "Isaiah 53:6",
      "ot_prophecy": "We all, like sheep, have gone astray, each of us has turned to our own way; and the LORD has laid on him the iniquity of us all.",
      "nt_ref": "1 Peter 2:25, Romans 4:25",
      "nt_fulfillment": "For “you were like sheep going astray,” but now you have returned to the Shepherd and Overseer of your souls... He was delivered over to death for our sins and was raised to life for our justification."
    },
    {
      "ot_ref": "Isaiah 53:7",
      "ot_prophecy": "He was oppressed and afflicted, yet he did not open his mouth; he was led like a lamb to the slaughter, and as a sheep before its shearers is silent, so he did not open his mouth.",
      "nt_ref": "Matthew 27:12-14",
      "nt_fulfillment": "When he was accused by the chief priests and the elders, he gave no answer... But Jesus made no reply, not even to a single charge—to the great amazement of the governor."
    },
    {
      "ot_ref": "Isaiah 53:8",
      "ot_prophecy": "By oppression and judgment he was taken away. Yet who of his generation protested? For he was cut off from the land of the living; for the transgression of my people he was punished.",
      "nt_ref": "Acts 8:32-35",
      "nt_fulfillment": "This is the passage of Scripture the eunuch was reading: “He was led like a sheep to the slaughter... In his humiliation he was deprived of justice... For his life was taken from the earth.” ... Then Philip began with that very passage of Scripture and told him the good news about Jesus."
    },
    {
      "ot_ref": "Isaiah 53:9",
      "ot_prophecy": "He was assigned a grave with the wicked, and with the rich in his death, though he had done no violence, nor was any deceit in his mouth.",
      "nt_ref": "Matthew 27:57-60, 1 Peter 2:22",
      "nt_fulfillment": "As evening approached, there came a rich man from Arimathea, named Joseph... went to Pilate and asked for Jesus’ body... Joseph took the body, wrapped it in a clean linen cloth, and placed it in his own new tomb... “He committed no sin, and no deceit was found in his mouth.”"
    },
    {
      "ot_ref": "Isaiah 53:10",
      "ot_prophecy": "Yet it was the LORD’s will to crush him and cause him to suffer, and though the LORD makes his life an offering for sin, he will see his offspring and prolong his days, and the will of the LORD will prosper in his hand.",
      "nt_ref": "Romans 8:32, John 12:24",
      "nt_fulfillment": "He who did not spare his own Son, but gave him up for us all—how will he not also, along with him, graciously give us all things?... Very truly I tell you, unless a kernel of wheat falls to the ground and dies, it remains only a single seed. But if it dies, it produces many seeds."
    },
    {
      "ot_ref": "Isaiah 53:11",
      "ot_prophecy": "After he has suffered, he will see the light of life and be satisfied; by his knowledge my righteous servant will justify many, and he will bear their iniquities.",
      "nt_ref": "John 10:11, Romans 5:19",
      "nt_fulfillment": "“I am the good shepherd. The good shepherd lays down his life for the sheep.”... For just as through the disobedience of the one man the many were made sinners, so also through the obedience of the one man the many will be made righteous."
    },
    {
      "ot_ref": "Isaiah 53:12",
      "ot_prophecy": "Therefore I will give him a portion among the great, and he will divide the spoils with the strong, because he poured out his life unto death, and was numbered with the transgressors. For he bore the sin of many, and made intercession for the transgressors.",
      "nt_ref": "Mark 15:27-28, Luke 23:34, Hebrews 7:25",
      "nt_fulfillment": "They crucified two rebels with him, one on his right and one on his left. [And the scripture was fulfilled that says, “He was numbered with the transgressors.”]... Jesus said, “Father, forgive them, for they do not know what they are doing.”... Therefore he is able to save completely those who come to God through him, because he always lives to intercede for them."
    },
    {
      "ot_ref": "Isaiah 55:3",
      "ot_prophecy": "Give ear and come to me; listen, that you may live. I will make an everlasting covenant with you, my faithful love promised to David.",
      "nt_ref": "Acts 13:34",
      "nt_fulfillment": "God raised him from the dead so that he will never be subject to decay. As God has said, ‘I will give you the holy and sure blessings promised to David.’"
    },
    {
      "ot_ref": "Isaiah 61:1-2",
      "ot_prophecy": "The Spirit of the Sovereign LORD is on me, because the LORD has anointed me to proclaim good news to the poor. He has sent me to bind up the brokenhearted, to proclaim freedom for the captives and release from darkness for the prisoners, to proclaim the year of the LORD’s favor...",
      "nt_ref": "Luke 4:18-19, 21",
      "nt_fulfillment": "“The Spirit of the Lord is on me, because he has anointed me to proclaim good news to the poor. He has sent me to proclaim freedom for the prisoners and recovery of sight for the blind, to set the oppressed free, to proclaim the year of the Lord’s favor.”... He began by saying to them, “Today this scripture is fulfilled in your hearing.”"
    },
    {
      "ot_ref": "Jeremiah 23:5-6",
      "ot_prophecy": "“The days are coming,” declares the LORD, “when I will raise up for David a righteous Branch, a King who will reign wisely and do what is just and right in the land. In his days Judah will be saved and Israel will live in safety. This is the name by which he will be called: The LORD Our Righteous Savior.\"",
      "nt_ref": "Luke 1:32-33, John 1:49, 1 Corinthians 1:30",
      "nt_fulfillment": "He will be great... The Lord God will give him the throne of his father David, and he will reign... forever... “Rabbi, you are the Son of God; you are the king of Israel.”... It is because of him that you are in Christ Jesus, who has become for us wisdom from God—that is, our righteousness, holiness and redemption."
    },
    {
      "ot_ref": "Jeremiah 31:15",
      "ot_prophecy": "This is what the LORD says: “A voice is heard in Ramah, mourning and great weeping, Rachel weeping for her children and refusing to be comforted, because they are no more.”",
      "nt_ref": "Matthew 2:16-18",
      "nt_fulfillment": "When Herod realized that he had been outwitted by the Magi, he was furious, and he gave orders to kill all the boys in Bethlehem and its vicinity who were two years old and under... Then what was said through the prophet Jeremiah was fulfilled: “A voice is heard in Ramah, weeping and great mourning, Rachel weeping for her children and refusing to be comforted, because they are no more.”"
    },
    {
      "ot_ref": "Jeremiah 31:31-34",
      "ot_prophecy": "“The days are coming,” declares the LORD, “when I will make a new covenant with the people of Israel and with the people of Judah... I will put my law in their minds and write it on their hearts. I will be their God, and they will be my people... For I will forgive their wickedness and will remember their sins no more.”",
      "nt_ref": "Matthew 26:28, Hebrews 8:8-12, 10:16-17",
      "nt_fulfillment": "This is my blood of the covenant, which is poured out for many for the forgiveness of sins... But God found fault with the people and said: “The days are coming, declares the Lord, when I will make a new covenant with the people of Israel and with the people of Judah... This is the covenant I will establish with the people of Israel after that time, declares the Lord. I will put my laws in their minds and write them on their hearts...” ... “This is the covenant I will make with them after that time, says the Lord. I will put my laws in their hearts, and I will write them on their minds.” Then he adds: “Their sins and lawless acts I will remember no more.”"
    },
    {
      "ot_ref": "Daniel 2:44-45",
      "ot_prophecy": "In the time of those kings, the God of heaven will set up a kingdom that will never be destroyed, nor will it be left to another people. It will crush all those kingdoms and bring them to an end, but it will itself endure forever. This is the meaning of the vision of the rock cut out of a mountain, but not by human hands...",
      "nt_ref": "Luke 1:33, John 18:36",
      "nt_fulfillment": "...his kingdom will never end.” ... Jesus said, “My kingdom is not of this world. If it were, my servants would fight to prevent my arrest by the Jewish leaders. But now my kingdom is from another place.”"
    },
    {
      "ot_ref": "Daniel 7:13-14",
      "ot_prophecy": "In my vision at night I looked, and there before me was one like a son of man, coming with the clouds of heaven... He was given authority, glory and sovereign power; all nations and peoples of every language worshiped him. His dominion is an everlasting dominion that will not pass away, and his kingdom is one that will never be destroyed.",
      "nt_ref": "Matthew 24:30, 26:64, Revelation 1:7",
      "nt_fulfillment": "“Then will appear the sign of the Son of Man in heaven. And then all the peoples of the earth will mourn when they see the Son of Man coming on the clouds of heaven, with power and great glory.” ... “You have said so,” Jesus replied. “But I say to all of you: From now on you will see the Son of Man sitting at the right hand of the Mighty One and coming on the clouds of heaven.” ... “Look, he is coming with the clouds,” and “every eye will see him, even those who pierced him”; and all peoples on earth “will mourn because of him.” So shall it be! Amen."
    },
    {
      "ot_ref": "Daniel 9:24",
      "ot_prophecy": "Seventy ‘sevens’ are decreed for your people and your holy city to finish transgression, to put an end to sin, to atone for wickedness, to bring in everlasting righteousness, to seal up vision and prophecy and to anoint the Most Holy Place.",
      "nt_ref": "Romans 5:8, Hebrews 9:12",
      "nt_fulfillment": "But God demonstrates his own love for us in this: While we were still sinners, Christ died for us... He did not enter by means of the blood of goats and calves; but he entered the Most Holy Place once for all by his own blood, thus obtaining eternal redemption."
    },
    {
      "ot_ref": "Daniel 9:25",
      "ot_prophecy": "Know and understand this: From the time the word goes out to restore and rebuild Jerusalem until the Anointed One, the ruler, comes, there will be seven ‘sevens,’ and sixty-two ‘sevens.’",
      "nt_ref": "Luke 2:1-2, 11",
      "nt_fulfillment": "In those days Caesar Augustus issued a decree that a census should be taken of the entire Roman world. (This was the first census that took place while Quirinius was governor of Syria.)... Today in the town of David a Savior has been born to you; he is the Messiah, the Lord."
    },
    {
      "ot_ref": "Daniel 9:26a",
      "ot_prophecy": "After the sixty-two ‘sevens,’ the Anointed One will be put to death and will have nothing.",
      "nt_ref": "Mark 9:12, John 19:18",
      "nt_fulfillment": "He answered, “To be sure, Elijah does come first, and restores all things. Why then is it written that the Son of Man must suffer much and be rejected?” ... There they crucified him, and with him two others—one on each side and Jesus in the middle."
    },
    {
      "ot_ref": "Hosea 11:1",
      "ot_prophecy": "When Israel was a child, I loved him, and out of Egypt I called my son.",
      "nt_ref": "Matthew 2:14-15",
      "nt_fulfillment": "So he got up, took the child and his mother during the night and left for Egypt, where he stayed until the death of Herod. And so was fulfilled what the Lord had said through the prophet: “Out of Egypt I called my son.”"
    },
    {
      "ot_ref": "Joel 2:28-29",
      "ot_prophecy": "And afterward, I will pour out my Spirit on all people. Your sons and daughters will prophesy, your old men will dream dreams, your young men will see visions. Even on my servants, both men and women, I will pour out my Spirit in those days.",
      "nt_ref": "Acts 2:16-18, 33",
      "nt_fulfillment": "No, this is what was spoken by the prophet Joel: ‘In the last days, God says, I will pour out my Spirit on all people... Even on my servants, both men and women, I will pour out my Spirit in those days, and they will prophesy.'... Exalted to the right hand of God, he has received from the Father the promised Holy Spirit and has poured out what you now see and hear."
    },
    {
      "ot_ref": "Micah 5:2",
      "ot_prophecy": "But you, Bethlehem Ephrathah, though you are small among the clans of Judah, out of you will come for me one who will be ruler over Israel, whose origins are from of old, from ancient times.",
      "nt_ref": "Matthew 2:1, 5-6, Luke 2:4-7",
      "nt_fulfillment": "After Jesus was born in Bethlehem in Judea... “In Bethlehem in Judea,” they replied... ‘But you, Bethlehem, in the land of Judah... out of you will come a ruler...’ So Joseph also went up from the town of Nazareth in Galilee to Judea, to Bethlehem the town of David... and she gave birth to her firstborn, a son."
    },
    {
      "ot_ref": "Zechariah 6:12-13",
      "ot_prophecy": "Tell him this is what the LORD Almighty says: ‘Here is the man whose name is the Branch, and he will branch out from his place and build the temple of the LORD. It is he who will build the temple of the LORD, and he will be clothed with majesty and will sit and rule on his throne. And he will be a priest on his throne. And there will be harmony between the two.’",
      "nt_ref": "John 1:14, Hebrews 8:1",
      "nt_fulfillment": "The Word became flesh and made his dwelling among us... Now the main point of what we are saying is this: We do have such a high priest, who sat down at the right hand of the throne of the Majesty in heaven,"
    },
    {
      "ot_ref": "Zechariah 9:9",
      "ot_prophecy": "Rejoice greatly, Daughter Zion! Shout, Daughter Jerusalem! See, your king comes to you, righteous and victorious, lowly and riding on a donkey, on a colt, the foal of a donkey.",
      "nt_ref": "Matthew 21:4-5, 9",
      "nt_fulfillment": "This took place to fulfill what was spoken through the prophet: “Say to Daughter Zion, ‘See, your king comes to you, gentle and riding on a donkey, and on a colt, the foal of a donkey.’” ...The crowds that went ahead of him and those that followed shouted, “Hosanna to the Son of David!”..."
    },
    {
      "ot_ref": "Zechariah 11:12-13",
      "ot_prophecy": "I told them, “If you think it best, give me my pay; but if not, keep it.” So they paid me thirty pieces of silver. And the LORD said to me, “Throw it to the potter”—the handsome price at which they valued me! So I took the thirty pieces of silver and threw them to the potter at the house of the LORD.",
      "nt_ref": "Matthew 26:14-15, 27:3-7",
      "nt_fulfillment": "Then one of the Twelve—the one called Judas Iscariot—went to the chief priests and asked, “What are you willing to give me if I deliver him over to you?” So they counted out for him thirty pieces of silver... When Judas... saw that Jesus was condemned, he was seized with remorse... So Judas threw the money into the temple and left... The chief priests picked up the coins... they decided to use the money to buy the potter’s field..."
    },
    {
      "ot_ref": "Zechariah 12:10",
      "ot_prophecy": "And I will pour out on the house of David and the inhabitants of Jerusalem a spirit of grace and supplication. They will look on me, the one they have pierced, and they will mourn for him as one mourns for an only child, and grieve bitterly for him as one grieves for a firstborn son.",
      "nt_ref": "John 19:34, 37, Revelation 1:7",
      "nt_fulfillment": "Instead, one of the soldiers pierced Jesus’ side with a spear... and, as another scripture says, “They will look on the one they have pierced.”... “Look, he is coming with the clouds,” and “every eye will see him, even those who pierced him”..."
    },
    {
      "ot_ref": "Zechariah 13:7",
      "ot_prophecy": "“Awake, sword, against my shepherd, against the man who is close to me!” declares the LORD Almighty. “Strike the shepherd, and the sheep will be scattered, and I will turn my hand against the little ones.\"",
      "nt_ref": "Matthew 26:31, 56",
      "nt_fulfillment": "Then Jesus told them, “This very night you will all fall away on account of me, for it is written: ‘I will strike the shepherd, and the sheep of the flock will be scattered.’” ... But this has all taken place that the writings of the prophets might be fulfilled.” Then all the disciples deserted him and fled."
    },
    {
      "ot_ref": "Malachi 3:1",
      "ot_prophecy": "“I will send my messenger, who will prepare the way before me. Then suddenly the Lord you are seeking will come to his temple; the messenger of the covenant, whom you desire, will come,” says the LORD Almighty.",
      "nt_ref": "Matthew 11:10, Mark 1:2",
      "nt_fulfillment": "This is the one about whom it is written: ‘I will send my messenger ahead of you, who will prepare your way before you.’ ... as it is written in Isaiah the prophet: “I will send my messenger ahead of you, who will prepare your way”—"
    },
    {
      "ot_ref": "Malachi 4:5-6",
      "ot_prophecy": "See, I will send the prophet Elijah to you before that great and dreadful day of the LORD comes. He will turn the hearts of the parents to their children, and the hearts of the children to their parents; or else I will come and strike the land with total destruction.”",
      "nt_ref": "Matthew 11:13-14, Luke 1:17",
      "nt_fulfillment": "For all the Prophets and the Law prophesied until John. And if you are willing to accept it, he is the Elijah who was to come... And he will go on before the Lord, in the spirit and power of Elijah, to turn the hearts of the parents to their children and the disobedient to the wisdom of the righteous—to make ready a people prepared for the Lord.”"
    }
  ]