[
    {
      "ot_ref": "Genesis 3:15",
      "ot_prophecy": "And I will put enmity between you and the woman, and between your offspring and hers; he will crush your head, and you will strike his heel.",
      "nt_ref": "Galatians 4:4, Hebrews 2:14, 1 John 3:8",
      "nt_fulfillment": "But when the fullness of the time came, God sent forth His Son, born of a woman... that through death He might render powerless him who had the power of death... The reason the Son of God appeared was to destroy the works of the devil."
    },
    {
      "ot_ref": "Genesis 5:24",
      "ot_prophecy": "Enoch walked faithfully with God; then he was no more, because God took him away.",
      "nt_ref": "Mark 16:19, Hebrews 11:5",
      "nt_fulfillment": "(Type/Foreshadowing of Ascension) After the Lord Jesus had spoken to them, he was taken up into heaven... By faith Enoch was taken from this life, so that he did not experience death..."
    },
    {
      "ot_ref": "Genesis 9:26-27",
      "ot_prophecy": "He also said, “Praise be to the LORD, the God of Shem! May Canaan be the slave of Shem. May God extend Japheth’s territory; may Japheth live in the tents of Shem...\"",
      "nt_ref": "Luke 3:36",
      "nt_fulfillment": "(Genealogy Link) ...the son of Shem, the son of Noah..."
    },
    {
      "ot_ref": "Genesis 12:3",
      "ot_prophecy": "I will bless those who bless you, and whoever curses you I will curse; and all peoples on earth will be blessed through you.",
      "nt_ref": "Acts 3:25-26, Galatians 3:8",
      "nt_fulfillment": "‘Through your offspring all peoples on earth will be blessed.’ When God raised up his servant, he sent him first to you to bless you... Scripture foresaw... announced the gospel in advance to Abraham: “All nations will be blessed through you.”"
    },
    {
      "ot_ref": "Genesis 12:7",
      "ot_prophecy": "The LORD appeared to Abram and said, “To your offspring I will give this land.”",
      "nt_ref": "Galatians 3:16",
      "nt_fulfillment": "The promises were spoken to Abraham and to his seed. Scripture does not say “and to seeds,” meaning many people, but “and to your seed,” meaning one person, who is Christ."
    },
    {
      "ot_ref": "Genesis 14:18",
      "ot_prophecy": "Then Melchizedek king of Salem brought out bread and wine. He was priest of God Most High,",
      "nt_ref": "Hebrews 5:6, 6:20, 7:1-3",
      "nt_fulfillment": "“You are a priest forever, in the order of Melchizedek.” ...where Jesus, who went before us, has entered on our behalf. He has become a high priest forever, in the order of Melchizedek..."
    },
    {
      "ot_ref": "Genesis 17:19",
      "ot_prophecy": "Then God said, “Yes, but your wife Sarah will bear you a son, and you will call him Isaac. I will establish my covenant with him as an everlasting covenant for his descendants after him.\"",
      "nt_ref": "Matthew 1:2, Romans 9:7",
      "nt_fulfillment": "Abraham was the father of Isaac, Isaac the father of Jacob... “It is through Isaac that your offspring will be reckoned.”"
    },
    {
      "ot_ref": "Genesis 22:8",
      "ot_prophecy": "Abraham answered, “God himself will provide the lamb for the burnt offering, my son.”",
      "nt_ref": "John 1:29",
      "nt_fulfillment": "“Look, the Lamb of God, who takes away the sin of the world!\""
    },
    {
      "ot_ref": "Genesis 22:18",
      "ot_prophecy": "and through your offspring all nations on earth will be blessed, because you have obeyed me.",
      "nt_ref": "Galatians 3:16",
      "nt_fulfillment": "The promises were spoken to Abraham and to his seed... “and to your seed,” meaning one person, who is Christ."
    },
    {
      "ot_ref": "Genesis 26:4",
      "ot_prophecy": "I will make your descendants as numerous as the stars... and through your offspring all nations on earth will be blessed,",
      "nt_ref": "Matthew 1:1-2, Galatians 3:16",
      "nt_fulfillment": "Jesus Christ the son of David, the son of Abraham: Abraham was the father of Isaac... The promises were spoken to Abraham and to his seed... meaning one person, who is Christ."
    },
    {
      "ot_ref": "Genesis 28:12",
      "ot_prophecy": "He had a dream in which he saw a stairway resting on the earth, with its top reaching to heaven, and the angels of God were ascending and descending on it.",
      "nt_ref": "John 1:51",
      "nt_fulfillment": "(Jesus applying the type) He then added, “Very truly I tell you, you will see ‘heaven open, and the angels of God ascending and descending on’ the Son of Man.”"
    },
    {
      "ot_ref": "Genesis 28:14",
      "ot_prophecy": "Your descendants will be like the dust of the earth... All peoples on earth will be blessed through you and your offspring.",
      "nt_ref": "Luke 3:34, Galatians 3:16",
      "nt_fulfillment": "...the son of Jacob, the son of Isaac, the son of Abraham... The promises were spoken to Abraham and to his seed... meaning one person, who is Christ."
    },
    {
      "ot_ref": "Genesis 49:10",
      "ot_prophecy": "The scepter will not depart from Judah... until he to whom it belongs shall come and the obedience of the nations shall be his.",
      "nt_ref": "Luke 3:33, John 1:49, Revelation 5:5",
      "nt_fulfillment": "...the son of Judah... “Rabbi, you are the Son of God; you are the king of Israel.” ... “See, the Lion of the tribe of Judah, the Root of David, has triumphed...”"
    },
    {
      "ot_ref": "Exodus 3:14",
      "ot_prophecy": "God said to Moses, “I AM WHO I AM... ‘I AM has sent me to you.’”",
      "nt_ref": "John 8:58",
      "nt_fulfillment": "“Very truly I tell you,” Jesus answered, “before Abraham was born, I am!”"
    },
    {
      "ot_ref": "Exodus 12:5",
      "ot_prophecy": "The animals you choose must be year-old males without defect...",
      "nt_ref": "1 Peter 1:19, Hebrews 9:14",
      "nt_fulfillment": "...but with the precious blood of Christ, a lamb without blemish or defect... How much more... will the blood of Christ, who... offered himself unblemished to God..."
    },
    {
      "ot_ref": "Exodus 12:7",
      "ot_prophecy": "...take some of the blood and put it on the sides and tops of the doorframes...",
      "nt_ref": "Hebrews 9:13-14",
      "nt_fulfillment": "The blood of goats and bulls... sprinkle the defiled, sanctify them... How much more... will the blood of Christ... cleanse our consciences..."
    },
    {
      "ot_ref": "Exodus 12:13",
      "ot_prophecy": "...when I see the blood, I will pass over you.",
      "nt_ref": "1 Corinthians 5:7, Romans 5:8-9",
      "nt_fulfillment": "For Christ, our Passover lamb, has been sacrificed... Since we have now been justified by his blood, how much more shall we be saved from God’s wrath through him!"
    },
    {
      "ot_ref": "Exodus 12:21-27",
      "ot_prophecy": "(Institution of Passover)",
      "nt_ref": "1 Corinthians 5:7",
      "nt_fulfillment": "Get rid of the old yeast, so that you may be a new unleavened batch—as you really are. For Christ, our Passover lamb, has been sacrificed."
    },
    {
      "ot_ref": "Exodus 12:46 / Numbers 9:12",
      "ot_prophecy": "Do not break any of the bones.",
      "nt_ref": "John 19:33, 36",
      "nt_fulfillment": "...they did not break his legs... so that the scripture would be fulfilled: “Not one of his bones will be broken,”"
    },
    {
      "ot_ref": "Exodus 13:2",
      "ot_prophecy": "Consecrate to me every firstborn male. The first offspring of every womb among the Israelites belongs to me, whether human or animal.",
      "nt_ref": "Luke 2:7, 23, Colossians 1:15, 18",
      "nt_fulfillment": "...and she gave birth to her firstborn, a son... as it is written in the Law of the Lord, “Every firstborn male is to be consecrated to the Lord”... The Son is the image of the invisible God, the firstborn over all creation... And he is the head of the body, the church; he is the beginning and the firstborn from among the dead..."
    },
    {
      "ot_ref": "Exodus 15:2",
      "ot_prophecy": "The LORD is my strength and my defense; he has become my salvation (Yeshua).",
      "nt_ref": "Acts 4:12, Matthew 1:21",
      "nt_fulfillment": "Salvation is found in no one else, for there is no other name under heaven given to mankind by which we must be saved.”... and you are to give him the name Jesus (Yeshua), because he will save his people from their sins.”"
    },
    {
      "ot_ref": "Exodus 17:6",
      "ot_prophecy": "Strike the rock, and water will come out of it for the people to drink.",
      "nt_ref": "1 Corinthians 10:4, John 4:14",
      "nt_fulfillment": "...and that rock was Christ... but whoever drinks the water I give them will never thirst..."
    },
    {
      "ot_ref": "Exodus 24:8",
      "ot_prophecy": "Moses then took the blood, sprinkled it on the people and said, “This is the blood of the covenant that the LORD has made with you in accordance with all these words.”",
      "nt_ref": "Matthew 26:28, Hebrews 9:19-20",
      "nt_fulfillment": "This is my blood of the covenant, which is poured out for many for the forgiveness of sins... When Moses had proclaimed every command of the law to all the people, he took the blood... sprinkled the scroll and all the people. He said, “This is the blood of the covenant, which God has commanded you to keep.”"
    },
    {
      "ot_ref": "Leviticus 16:15-17",
      "ot_prophecy": "(Day of Atonement sacrifice for the people's sin)",
      "nt_ref": "Hebrews 9:11-12, 24-26",
      "nt_fulfillment": "But when Christ came as high priest... He did not enter by means of the blood of goats and calves; but he entered the Most Holy Place once for all by his own blood... For Christ did not enter a sanctuary made with human hands... He entered heaven itself... nor did he enter heaven to offer himself again and again... But he has appeared once for all at the culmination of the ages to do away with sin by the sacrifice of himself."
    },
    {
      "ot_ref": "Leviticus 16:27",
      "ot_prophecy": "...are to be taken outside the camp; their hides, flesh and intestines are to be burned up.",
      "nt_ref": "Hebrews 13:11-12",
      "nt_fulfillment": "...the bodies are burned outside the camp. And so Jesus also suffered outside the city gate..."
    },
    {
      "ot_ref": "Leviticus 17:11",
      "ot_prophecy": "For the life of a creature is in the blood... it is the blood that makes atonement for one’s life.",
      "nt_ref": "Matthew 26:28, 1 John 1:7, Hebrews 9:22",
      "nt_fulfillment": "This is my blood of the covenant... for the forgiveness of sins... the blood of Jesus... purifies us from all sin... without the shedding of blood there is no forgiveness."
    },
    {
      "ot_ref": "Numbers 21:9",
      "ot_prophecy": "So Moses made a bronze snake and put it up on a pole. Then when anyone was bitten... and looked at the bronze snake, they lived.",
      "nt_ref": "John 3:14-15",
      "nt_fulfillment": "Just as Moses lifted up the snake... so the Son of Man must be lifted up, that everyone who believes may have eternal life in him.”"
    },
    {
      "ot_ref": "Numbers 24:17",
      "ot_prophecy": "A star will come out of Jacob; a scepter will rise out of Israel.",
      "nt_ref": "Matthew 2:1-2, Luke 1:33",
      "nt_fulfillment": "Magi... asked, “Where is the one who has been born king of the Jews? We saw his star...”... and he will reign over Jacob’s descendants forever..."
    },
    {
      "ot_ref": "Deuteronomy 18:15",
      "ot_prophecy": "The LORD your God will raise up for you a prophet like me from among you... You must listen to him.",
      "nt_ref": "John 1:45, 6:14, Acts 3:22",
      "nt_fulfillment": "Philip found Nathanael and told him, “We have found the one Moses wrote about in the Law, and about whom the prophets also wrote—Jesus of Nazareth...”... they began to say, “Surely this is the Prophet...”... For Moses said, ‘The Lord your God will raise up for you a prophet like me...'"
    },
    {
      "ot_ref": "Deuteronomy 18:18-19",
      "ot_prophecy": "I will raise up for them a prophet like you... I will put my words in his mouth... I myself will call to account anyone who does not listen...",
      "nt_ref": "John 12:48-50, Acts 3:23",
      "nt_fulfillment": "There is a judge for the one who rejects me and does not accept my words; the very words I have spoken will condemn them at the last day... So whatever I say is just what the Father has told me to say.” ... Anyone who does not listen to him will be completely cut off from their people.’"
    },
    {
      "ot_ref": "Deuteronomy 21:23",
      "ot_prophecy": "...anyone who is hung on a pole is under God’s curse...",
      "nt_ref": "Galatians 3:13",
      "nt_fulfillment": "Christ redeemed us from the curse of the law by becoming a curse for us, for it is written: “Cursed is everyone who is hung on a pole.”"
    },
    {
      "ot_ref": "Deuteronomy 32:43",
      "ot_prophecy": "Rejoice, you nations, with his people, for he will avenge the blood of his servants; he will take vengeance on his enemies and make atonement for his land and people.",
      "nt_ref": "Romans 15:10, Hebrews 1:6",
      "nt_fulfillment": "(Allusion to Gentile inclusion) Again, it says, “Rejoice, you Gentiles, with his people.”... And again, when God brings his firstborn into the world, he says, “Let all God’s angels worship him.”"
    },
    {
      "ot_ref": "Ruth 4:4-10",
      "ot_prophecy": "(Story of Boaz, the kinsman-redeemer)",
      "nt_ref": "Ephesians 1:7, Matthew 1:5",
      "nt_fulfillment": "(Typology of Redemption) In him we have redemption through his blood... Salmon the father of Boaz... Boaz the father of Obed..."
    },
    {
      "ot_ref": "1 Samuel 2:10",
      "ot_prophecy": "...He will give strength to his king and exalt the horn of his anointed.",
      "nt_ref": "Luke 1:69, Matthew 28:18",
      "nt_fulfillment": "He has raised up a horn of salvation for us in the house of his servant David... Then Jesus came to them and said, “All authority in heaven and on earth has been given to me.”"
    },
    {
      "ot_ref": "1 Samuel 2:35",
      "ot_prophecy": "I will raise up for myself a faithful priest, who will do according to what is in my heart and mind. I will firmly establish his priestly house, and they will minister before my anointed one always.",
      "nt_ref": "Hebrews 2:17, 3:1, 7:24-25",
      "nt_fulfillment": "For this reason he had to be made like them, fully human in every way, in order that he might become a merciful and faithful high priest... Therefore, holy brothers and sisters... fix your thoughts on Jesus, whom we acknowledge as our apostle and high priest... because Jesus lives forever, he has a permanent priesthood. Therefore he is able to save completely..."
    },
    {
      "ot_ref": "2 Samuel 7:12-13",
      "ot_prophecy": "I will raise up your offspring... and I will establish his kingdom. He... will build a house for my Name, and I will establish the throne of his kingdom forever.",
      "nt_ref": "Matthew 1:1, Luke 1:32-33",
      "nt_fulfillment": "Jesus Christ the son of David... The Lord God will give him the throne of his father David... his kingdom will never end.”"
    },
    {
      "ot_ref": "2 Samuel 7:14a",
      "ot_prophecy": "I will be his father, and he shall be my son.",
      "nt_ref": "Luke 1:32, Hebrews 1:5",
      "nt_fulfillment": "He will be great and will be called the Son of the Most High... For to which of the angels did God ever say, “You are my Son...?”"
    },
    {
      "ot_ref": "2 Samuel 7:16",
      "ot_prophecy": "Your house and your kingdom will endure forever before me; your throne will be established forever.’",
      "nt_ref": "Luke 1:33, Revelation 11:15",
      "nt_fulfillment": "...his kingdom will never end.”... “The kingdom of the world has become the kingdom of our Lord and of his Messiah, and he will reign for ever and ever.”"
    },
    {
      "ot_ref": "1 Chronicles 17:11-14",
      "ot_prophecy": "I will raise up your offspring... He is the one who will build a house for me... I will be his father, and he will be my son... his throne will be established forever.’",
      "nt_ref": "Luke 1:32-33",
      "nt_fulfillment": "He will be great... The Lord God will give him the throne of his father David... his kingdom will never end.”"
    },
    {
      "ot_ref": "Job 19:25-27",
      "ot_prophecy": "I know that my redeemer lives, and that in the end he will stand on the earth... in my flesh I will see God...",
      "nt_ref": "1 Corinthians 15:20-23, 1 Thessalonians 4:16",
      "nt_fulfillment": "But Christ has indeed been raised from the dead, the firstfruits of those who have fallen asleep... For the Lord himself will come down from heaven... and the dead in Christ will rise first."
    },
    {
      "ot_ref": "Psalm 2:1-2",
      "ot_prophecy": "Why do the nations conspire...? The kings... and the rulers band together against the LORD and against his anointed one.",
      "nt_ref": "Acts 4:25-28",
      "nt_fulfillment": "Indeed Herod and Pontius Pilate met together with the Gentiles and the people of Israel... to conspire against your holy servant Jesus, whom you anointed."
    },
    {
      "ot_ref": "Psalm 2:6",
      "ot_prophecy": "I have installed my king on Zion, my holy mountain.",
      "nt_ref": "John 18:37, Revelation 19:16",
      "nt_fulfillment": "“You say that I am a king...”... On his robe and on his thigh he has this name written: KING OF KINGS AND LORD OF LORDS."
    },
    {
      "ot_ref": "Psalm 2:7",
      "ot_prophecy": "He said to me, “You are my son; today I have become your father.\"",
      "nt_ref": "Matthew 3:17, Luke 1:35, Acts 13:33, Hebrews 1:5",
      "nt_fulfillment": "“This is my Son, whom I love...”... “So the holy one to be born will be called the Son of God.”... ‘You are my son; today I have become your father.’... “You are my Son...”"
    },
    {
      "ot_ref": "Psalm 2:8-9",
      "ot_prophecy": "Ask me, and I will make the nations your inheritance... You will break them with a rod of iron...",
      "nt_ref": "Revelation 2:26-27, 12:5, 19:15",
      "nt_fulfillment": "To the one who is victorious... I will give authority over the nations— that one ‘will rule them with an iron scepter...’... She gave birth to a son... who “will rule all the nations with an iron scepter.”... Out of his mouth comes a sharp sword... He will rule them with an iron scepter."
    },
    {
      "ot_ref": "Psalm 2:12",
      "ot_prophecy": "Kiss his son, or he will be angry and your way will lead to your destruction, for his wrath can flare up in a moment. Blessed are all who take refuge in him.",
      "nt_ref": "John 3:36, Acts 4:12",
      "nt_fulfillment": "Whoever believes in the Son has eternal life, but whoever rejects the Son will not see life, for God’s wrath remains on them... Salvation is found in no one else..."
    },
    {
      "ot_ref": "Psalm 8:2",
      "ot_prophecy": "Through the praise of children and infants you have established a stronghold...",
      "nt_ref": "Matthew 21:15-16",
      "nt_fulfillment": "...the children shouting... “Hosanna to the Son of David,”... Jesus, “have you never read, ‘From the lips of children and infants you, Lord, have called forth your praise’?”"
    },
    {
      "ot_ref": "Psalm 8:4-6",
      "ot_prophecy": "what is mankind that you are mindful of them, human beings that you care for them? You have made them a little lower than the angels and crowned them with glory and honor. You made them rulers over the works of your hands; you put everything under their feet:",
      "nt_ref": "Hebrews 2:6-9",
      "nt_fulfillment": "But there is a place where someone has testified: “What is mankind that you are mindful of them... You made them a little lower than the angels; you crowned them with glory and honor and put everything under their feet.” ...But we do see Jesus, who was made lower than the angels for a little while, now crowned with glory and honor because he suffered death..."
    },
    {
      "ot_ref": "Psalm 16:10",
      "ot_prophecy": "...you will not abandon me to the realm of the dead, nor will you let your faithful one see decay.",
      "nt_ref": "Acts 2:27, 31, 13:35",
      "nt_fulfillment": "‘...you will not abandon me... you will not let your holy one see decay.’... he spoke of the resurrection... ‘You will not let your holy one see decay.’"
    },
    {
      "ot_ref": "Psalm 22:1",
      "ot_prophecy": "My God, my God, why have you forsaken me?",
      "nt_ref": "Matthew 27:46",
      "nt_fulfillment": "Jesus cried out... “My God, my God, why have you forsaken me?”."
    },
    {
      "ot_ref": "Psalm 22:7-8",
      "ot_prophecy": "All who see me mock me... “He trusts in the LORD,” they say, “let the LORD rescue him...\"",
      "nt_ref": "Matthew 27:39, 43",
      "nt_fulfillment": "Those who passed by hurled insults... He trusts in God. Let God rescue him now..."
    },
    {
      "ot_ref": "Psalm 22:14-15",
      "ot_prophecy": "I am poured out like water... My mouth is dried up...",
      "nt_ref": "John 19:28",
      "nt_fulfillment": "...Jesus said, “I am thirsty.”"
    },
    {
      "ot_ref": "Psalm 22:16",
      "ot_prophecy": "...they pierce my hands and my feet.",
      "nt_ref": "John 19:18, 37, 20:25-27",
      "nt_fulfillment": "There they crucified him... “They will look on the one they have pierced.”... “Unless I see the nail marks in his hands...”"
    },
    {
      "ot_ref": "Psalm 22:17",
      "ot_prophecy": "All my bones are on display; people stare and gloat over me.",
      "nt_ref": "Luke 23:35",
      "nt_fulfillment": "The people stood watching, and the rulers even sneered at him..."
    },
    {
      "ot_ref": "Psalm 22:18",
      "ot_prophecy": "They divide my clothes among them and cast lots for my garment.",
      "nt_ref": "John 19:23-24",
      "nt_fulfillment": "...they took his clothes, dividing them... “Let’s decide by lot who will get it.”..."
    },
    {
      "ot_ref": "Psalm 31:5",
      "ot_prophecy": "Into your hands I commit my spirit...",
      "nt_ref": "Luke 23:46",
      "nt_fulfillment": "Jesus called out... “Father, into your hands I commit my spirit.”..."
    },
    {
      "ot_ref": "Psalm 34:20",
      "ot_prophecy": "he protects all his bones, not one of them will be broken.",
      "nt_ref": "John 19:33, 36",
      "nt_fulfillment": "...they did not break his legs... “Not one of his bones will be broken,”"
    },
    {
      "ot_ref": "Psalm 35:11",
      "ot_prophecy": "Ruthless witnesses come forward; they question me on things I know nothing about.",
      "nt_ref": "Mark 14:57-58",
      "nt_fulfillment": "Then some stood up and gave this false testimony against him..."
    },
    {
      "ot_ref": "Psalm 35:19",
      "ot_prophecy": "...do not let those who hate me without reason maliciously wink the eye.",
      "nt_ref": "John 15:25",
      "nt_fulfillment": "‘They hated me without reason.’"
    },
    {
      "ot_ref": "Psalm 40:6-8",
      "ot_prophecy": "Sacrifice and offering you did not desire... burnt offerings and sin offerings you did not require. Then I said, “Here I am, I have come... I desire to do your will, my God...\"",
      "nt_ref": "Hebrews 10:5-7",
      "nt_fulfillment": "...when Christ came into the world, he said: “Sacrifice and offering you did not desire, but a body you prepared for me... Then I said, ‘Here I am... I have come to do your will, my God.’”"
    },
    {
      "ot_ref": "Psalm 41:9",
      "ot_prophecy": "Even my close friend... one who shared my bread, has turned against me.",
      "nt_ref": "John 13:18, 26",
      "nt_fulfillment": "‘He who shared my bread has turned against me.’... dipping the piece of bread, he gave it to Judas..."
    },
    {
      "ot_ref": "Psalm 45:2",
      "ot_prophecy": "You are the most excellent of men and your lips have been anointed with grace, since God has blessed you forever.",
      "nt_ref": "Luke 4:22",
      "nt_fulfillment": "All spoke well of him and were amazed at the gracious words that came from his lips."
    },
    {
      "ot_ref": "Psalm 45:6-7",
      "ot_prophecy": "Your throne, O God, will last for ever and ever... You love righteousness and hate wickedness; therefore God, your God, has set you above your companions...",
      "nt_ref": "Hebrews 1:8-9",
      "nt_fulfillment": "But about the Son he says, “Your throne, O God, will last for ever and ever... You have loved righteousness and hated wickedness; therefore God, your God, has set you above your companions...”"
    },
    {
      "ot_ref": "Psalm 68:18",
      "ot_prophecy": "When you ascended on high, you took many captives; you received gifts from people...",
      "nt_ref": "Acts 1:9, Ephesians 4:8",
      "nt_fulfillment": "...he was taken up before their very eyes... This is why it says: “When he ascended on high, he took many captives and gave gifts to his people.”"
    },
    {
      "ot_ref": "Psalm 69:4",
      "ot_prophecy": "Those who hate me without reason outnumber the hairs of my head...",
      "nt_ref": "John 15:25",
      "nt_fulfillment": "‘They hated me without reason.’"
    },
    {
      "ot_ref": "Psalm 69:9a",
      "ot_prophecy": "for zeal for your house consumes me...",
      "nt_ref": "John 2:17",
      "nt_fulfillment": "His disciples remembered that it is written: “Zeal for your house will consume me.”"
    },
    {
      "ot_ref": "Psalm 69:9b",
      "ot_prophecy": "...and the insults of those who insult you fall on me.",
      "nt_ref": "Romans 15:3",
      "nt_fulfillment": "For even Christ did not please himself but, as it is written: “The insults of those who insult you have fallen on me.”"
    },
    {
      "ot_ref": "Psalm 69:21",
      "ot_prophecy": "They put gall in my food and gave me vinegar for my thirst.",
      "nt_ref": "Matthew 27:34, 48",
      "nt_fulfillment": "...offered Jesus wine to drink, mixed with gall... filled it with wine vinegar... offered it to Jesus to drink."
    },
    {
      "ot_ref": "Psalm 72:10-11",
      "ot_prophecy": "May the kings of Tarshish and of distant shores bring tribute to him; may the kings of Sheba and Seba present him gifts. May all kings bow down to him and all nations serve him.",
      "nt_ref": "Matthew 2:1, 11",
      "nt_fulfillment": "Magi from the east came... They bowed down and worshiped him. Then they opened their treasures and presented him with gifts of gold, frankincense and myrrh."
    },
    {
      "ot_ref": "Psalm 72:17",
      "ot_prophecy": "May his name endure forever; may it continue as long as the sun. Then all nations will be blessed through him, and they will call him blessed.",
      "nt_ref": "Philippians 2:9-11",
      "nt_fulfillment": "Therefore God exalted him to the highest place and gave him the name that is above every name, that at the name of Jesus every knee should bow... and every tongue acknowledge that Jesus Christ is Lord..."
    },
    {
      "ot_ref": "Psalm 78:2",
      "ot_prophecy": "I will open my mouth with a parable; I will utter hidden things...",
      "nt_ref": "Matthew 13:34-35",
      "nt_fulfillment": "Jesus spoke all these things to the crowd in parables... So was fulfilled... “I will open my mouth in parables...”"
    },
    {
      "ot_ref": "Psalm 89:3-4",
      "ot_prophecy": "You said, “I have made a covenant with my chosen one, I have sworn to David my servant, ‘I will establish your line forever...’\"",
      "nt_ref": "Luke 1:32-33, Acts 2:30",
      "nt_fulfillment": "The Lord God will give him the throne of his father David... his kingdom will never end.”... he was a prophet and knew that God had promised him on oath..."
    },
    {
      "ot_ref": "Psalm 89:26",
      "ot_prophecy": "He will call out to me, ‘You are my Father, my God, the Rock my Savior.’",
      "nt_ref": "Matthew 11:27, John 20:17",
      "nt_fulfillment": "“All things have been committed to me by my Father. No one knows the Son except the Father, and no one knows the Father except the Son...” Jesus said, “...I am ascending to my Father and your Father, to my God and your God.”"
    },
    {
      "ot_ref": "Psalm 89:27",
      "ot_prophecy": "And I will appoint him to be my firstborn, the most exalted of the kings of the earth.",
      "nt_ref": "Colossians 1:15, 18, Revelation 1:5",
      "nt_fulfillment": "The Son is the image of the invisible God, the firstborn over all creation... he is the beginning and the firstborn from among the dead... and from Jesus Christ, who is the faithful witness, the firstborn from the dead, and the ruler of the kings of the earth."
    },
    {
      "ot_ref": "Psalm 102:25-27",
      "ot_prophecy": "In the beginning you laid the foundations of the earth, and the heavens are the work of your hands. They will perish, but you remain; they will all wear out like a garment... But you remain the same, and your years will never end.",
      "nt_ref": "Hebrews 1:10-12",
      "nt_fulfillment": "He also says, “In the beginning, Lord, you laid the foundations of the earth... They will perish, but you remain... But you remain the same, and your years will never end.”"
    },
    {
      "ot_ref": "Psalm 109:4",
      "ot_prophecy": "...but I am a man of prayer.",
      "nt_ref": "Luke 23:34",
      "nt_fulfillment": "Jesus said, “Father, forgive them...”"
    },
    {
      "ot_ref": "Psalm 109:8",
      "ot_prophecy": "May his days be few; may another take his place of leadership.",
      "nt_ref": "Acts 1:20",
      "nt_fulfillment": "‘May another take his place of leadership.’” (Applied to Judas)"
    },
    {
      "ot_ref": "Psalm 110:1",
      "ot_prophecy": "The LORD says to my lord: “Sit at my right hand until I make your enemies a footstool...\"",
      "nt_ref": "Matthew 22:44, Mark 16:19, Hebrews 1:13",
      "nt_fulfillment": "‘The Lord said to my Lord: “Sit at my right hand...”’... he was taken up into heaven and he sat at the right hand of God... To which of the angels did God ever say, “Sit at my right hand...?”"
    },
    {
      "ot_ref": "Psalm 110:4",
      "ot_prophecy": "The LORD has sworn... “You are a priest forever, in the order of Melchizedek.”",
      "nt_ref": "Hebrews 5:6, 7:17, 21",
      "nt_fulfillment": "“You are a priest forever, in the order of Melchizedek.”... For it is declared: “You are a priest forever, in the order of Melchizedek.”... but he became a priest with an oath when God said to him: “The Lord has sworn and will not change his mind: ‘You are a priest forever.’”"
    },
    {
      "ot_ref": "Psalm 118:22-23",
      "ot_prophecy": "The stone the builders rejected has become the cornerstone; the LORD has done this...",
      "nt_ref": "Matthew 21:42, Acts 4:11, 1 Peter 2:7",
      "nt_fulfillment": "‘The stone the builders rejected has become the cornerstone...’... Jesus is ‘the stone you builders rejected, which has become the cornerstone.’... “The stone the builders rejected has become the cornerstone,”"
    },
    {
      "ot_ref": "Psalm 118:26",
      "ot_prophecy": "Blessed is he who comes in the name of the LORD...",
      "nt_ref": "Matthew 21:9",
      "nt_fulfillment": "“Blessed is he who comes in the name of the Lord!”"
    },
    {
      "ot_ref": "Proverbs 8:22-23",
      "ot_prophecy": "The LORD brought me forth as the first of his works, before his deeds of old; I was formed long ages ago, at the very beginning, when the world came to be.",
      "nt_ref": "John 1:1-2, 17:5, Colossians 1:17",
      "nt_fulfillment": "(Wisdom personified, linked to Christ) In the beginning was the Word... He was with God in the beginning... And now, Father, glorify me in your presence with the glory I had with you before the world began... He is before all things, and in him all things hold together."
    },
    {
      "ot_ref": "Isaiah 7:14",
      "ot_prophecy": "The virgin will conceive and give birth to a son, and will call him Immanuel.",
      "nt_ref": "Matthew 1:22-23, Luke 1:34-35",
      "nt_fulfillment": "“The virgin will conceive and give birth to a son, and they will call him Immanuel”... Mary asked... “How will this be... since I am a virgin?” The angel answered... “The Holy Spirit will come on you...”"
    },
    {
      "ot_ref": "Isaiah 8:14",
      "ot_prophecy": "He will be a holy place; for both Israel and Judah he will be a stone that causes people to stumble and a rock that makes them fall.",
      "nt_ref": "Romans 9:33, 1 Peter 2:8",
      "nt_fulfillment": "As it is written: “See, I lay in Zion a stone that causes people to stumble and a rock that makes them fall...”... and, “A stone that causes people to stumble and a rock that makes them fall.” They stumble because they disobey the message..."
    },
    {
      "ot_ref": "Isaiah 9:1-2",
      "ot_prophecy": "...Galilee of the nations... The people walking in darkness have seen a great light...",
      "nt_ref": "Matthew 4:13-16",
      "nt_fulfillment": "...lived in Capernaum... Galilee of the Gentiles— the people living in darkness have seen a great light..."
    },
    {
      "ot_ref": "Isaiah 9:6",
      "ot_prophecy": "For to us a child is born, to us a son is given... And he will be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.",
      "nt_ref": "Luke 2:11, John 1:1, 14, 14:27",
      "nt_fulfillment": "a Savior has been born to you; he is the Messiah, the Lord... In the beginning was the Word, and the Word was with God, and the Word was God... The Word became flesh... Peace I leave with you; my peace I give you."
    },
    {
      "ot_ref": "Isaiah 9:7",
      "ot_prophecy": "Of the greatness of his government and peace there will be no end. He will reign on David’s throne... forever.",
      "nt_ref": "Luke 1:32-33",
      "nt_fulfillment": "The Lord God will give him the throne of his father David... his kingdom will never end.”"
    },
    {
      "ot_ref": "Isaiah 11:1",
      "ot_prophecy": "A shoot will come up from the stump of Jesse...",
      "nt_ref": "Matthew 1:1, 6",
      "nt_fulfillment": "Jesus Christ the son of David... Jesse the father of King David."
    },
    {
      "ot_ref": "Isaiah 11:2",
      "ot_prophecy": "The Spirit of the LORD will rest on him— the Spirit of wisdom...",
      "nt_ref": "Matthew 3:16-17, Luke 2:52",
      "nt_fulfillment": "...he saw the Spirit of God descending... “This is my Son...”... And Jesus grew in wisdom..."
    },
    {
      "ot_ref": "Isaiah 11:10",
      "ot_prophecy": "...the Root of Jesse will stand as a banner for the peoples; the nations will rally to him...",
      "nt_ref": "Romans 15:12",
      "nt_fulfillment": "“The Root of Jesse will spring up... in him the Gentiles will hope.”"
    },
    {
      "ot_ref": "Isaiah 25:8",
      "ot_prophecy": "he will swallow up death forever. The Sovereign LORD will wipe away the tears from all faces...",
      "nt_ref": "1 Corinthians 15:54, Revelation 21:4",
      "nt_fulfillment": "then the saying that is written will come true: “Death has been swallowed up in victory.”... ‘He will wipe every tear from their eyes. There will be no more death’ or mourning or crying or pain..."
    },
    {
      "ot_ref": "Isaiah 26:19",
      "ot_prophecy": "But your dead will live, LORD; their bodies will rise— let those who dwell in the dust wake up and shout for joy...",
      "nt_ref": "John 5:28-29, 1 Corinthians 15:52",
      "nt_fulfillment": "...a time is coming when all who are in their graves will hear his voice and come out... in a flash, in the twinkling of an eye, at the last trumpet. For the trumpet will sound, the dead will be raised imperishable..."
    },
    {
      "ot_ref": "Isaiah 28:16",
      "ot_prophecy": "“See, I lay a stone in Zion, a tested stone, a precious cornerstone...",
      "nt_ref": "Acts 4:11, Ephesians 2:20, 1 Peter 2:6-7",
      "nt_fulfillment": "Jesus is ‘the stone you builders rejected, which has become the cornerstone.’... built on the foundation of the apostles and prophets, with Christ Jesus himself as the chief cornerstone... “See, I lay a stone in Zion, a chosen and precious cornerstone...”"
    },
    {
      "ot_ref": "Isaiah 29:13",
      "ot_prophecy": "These people... honor me with their lips, but their hearts are far from me...",
      "nt_ref": "Matthew 15:7-9",
      "nt_fulfillment": "‘These people honor me with their lips, but their hearts are far from me...'"
    },
    {
      "ot_ref": "Isaiah 32:3-4",
      "ot_prophecy": "Then the eyes of those who see will no longer be closed, and the ears of those who hear will listen. The fearful heart will know and understand, and the stammering tongue will be fluent and clear.",
      "nt_ref": "Mark 7:32-35",
      "nt_fulfillment": "(Example of healing) Some people brought to Him a man who was deaf and hardly able to speak... Jesus... said... “Be opened!”... the man's ears were opened and his tongue was released, and he began to speak plainly."
    },
    {
      "ot_ref": "Isaiah 35:5-6",
      "ot_prophecy": "Then will the eyes of the blind be opened... the ears of the deaf unstopped... the lame leap... the mute tongue shout...",
      "nt_ref": "Matthew 11:4-5, Acts 3:6-8",
      "nt_fulfillment": "The blind receive sight, the lame walk... the deaf hear... Then Peter said, “...In the name of Jesus Christ of Nazareth, walk.” ...jumped to his feet and began to walk."
    },
    {
      "ot_ref": "Isaiah 40:3-5",
      "ot_prophecy": "A voice of one calling: “In the wilderness prepare the way for the LORD...\"",
      "nt_ref": "Matthew 3:1-3, Luke 3:4-6",
      "nt_fulfillment": "John the Baptist came... This is he who was spoken of... “A voice of one calling in the wilderness, ‘Prepare the way for the Lord...’”"
    },
    {
      "ot_ref": "Isaiah 42:1-4",
      "ot_prophecy": "Here is my servant... I will put my Spirit on him... He will not shout... A bruised reed he will not break...",
      "nt_ref": "Matthew 3:16-17, 12:17-21",
      "nt_fulfillment": "...he saw the Spirit of God descending... “This is my Son...”... This was to fulfill... “Here is my servant... I will put my Spirit on him... He will not quarrel... A bruised reed he will not break...”"
    },
    {
      "ot_ref": "Isaiah 42:6-7",
      "ot_prophecy": "I, the LORD, have called you in righteousness; I will take hold of your hand. I will keep you and will make you to be a covenant for the people and a light for the Gentiles, to open eyes that are blind, to free captives from prison...",
      "nt_ref": "Luke 2:32, Acts 26:17-18",
      "nt_fulfillment": "a light for revelation to the Gentiles... ‘...I am sending you to them to open their eyes and turn them from darkness to light, and from the power of Satan to God...'"
    },
    {
      "ot_ref": "Isaiah 43:10-11",
      "ot_prophecy": "“You are my witnesses,” declares the LORD, “and my servant whom I have chosen, so that you may know and believe me and understand that I am he. Before me no god was formed, nor will there be one after me. I, even I, am the LORD, and apart from me there is no savior.\"",
      "nt_ref": "John 8:58, Acts 4:12",
      "nt_fulfillment": "“Very truly I tell you,” Jesus answered, “before Abraham was born, I am!”... Salvation is found in no one else, for there is no other name under heaven given to mankind by which we must be saved.”"
    },
    {
      "ot_ref": "Isaiah 49:1",
      "ot_prophecy": "...from my mother’s womb he has spoken my name.",
      "nt_ref": "Luke 1:30-31",
      "nt_fulfillment": "...you are to call him Jesus.”"
    },
    {
      "ot_ref": "Isaiah 49:6",
      "ot_prophecy": "...I will also make you a light for the Gentiles, that my salvation may reach to the ends of the earth.”",
      "nt_ref": "Luke 2:32, Acts 13:47",
      "nt_fulfillment": "a light for revelation to the Gentiles... ‘I have made you a light for the Gentiles, that you may bring salvation to the ends of the earth.’”"
    },
    {
      "ot_ref": "Isaiah 50:6",
      "ot_prophecy": "I offered my back to those who beat me... I did not hide my face from mocking and spitting.",
      "nt_ref": "Matthew 26:67, 27:26, 30",
      "nt_fulfillment": "Then they spit in his face... he had Jesus flogged... They spit on him..."
    },
    {
      "ot_ref": "Isaiah 52:13",
      "ot_prophecy": "...he will be raised and lifted up and highly exalted.",
      "nt_ref": "Acts 1:9, Philippians 2:9",
      "nt_fulfillment": "...he was taken up before their very eyes... Therefore God exalted him to the highest place..."
    },
    {
      "ot_ref": "Isaiah 52:14",
      "ot_prophecy": "...his appearance was so disfigured... his form marred...",
      "nt_ref": "Philippians 2:7-8",
      "nt_fulfillment": "...he made himself nothing... humbled himself... to death on a cross!"
    },
    {
      "ot_ref": "Isaiah 52:15",
      "ot_prophecy": "so he will sprinkle many nations, and kings will shut their mouths because of him. For what they were not told, they will see, and what they have not heard, they will understand.",
      "nt_ref": "Romans 15:21, Hebrews 12:24",
      "nt_fulfillment": "Rather, as it is written: “Those who were not told about him will see, and those who have not heard will understand.”... to Jesus the mediator of a new covenant, and to the sprinkled blood that speaks a better word than the blood of Abel."
    },
    {
      "ot_ref": "Isaiah 53:1-3",
      "ot_prophecy": "Who has believed our message...? He had no beauty or majesty... He was despised and rejected...",
      "nt_ref": "John 12:37-38, 1:11",
      "nt_fulfillment": "Even after Jesus had performed so many signs in their presence, they still would not believe in him. This was to fulfill the word of Isaiah the prophet: “Lord, who has believed our message...?” He came to that which was his own, but his own did not receive him."
    },
    {
      "ot_ref": "Isaiah 53:4",
      "ot_prophecy": "Surely he took up our pain and bore our suffering...",
      "nt_ref": "Matthew 8:17",
      "nt_fulfillment": "“He took up our infirmities and bore our diseases.”"
    },
    {
      "ot_ref": "Isaiah 53:5",
      "ot_prophecy": "But he was pierced for our transgressions... by his wounds we are healed.",
      "nt_ref": "Romans 5:8, 1 Peter 2:24",
      "nt_fulfillment": "...Christ died for us... “by his wounds you have been healed.”"
    },
    {
      "ot_ref": "Isaiah 53:6",
      "ot_prophecy": "...the LORD has laid on him the iniquity of us all.",
      "nt_ref": "1 Peter 2:24-25, Romans 4:25",
      "nt_fulfillment": "“He himself bore our sins”... For “you were like sheep going astray,”... He was delivered over to death for our sins..."
    },
    {
      "ot_ref": "Isaiah 53:7",
      "ot_prophecy": "...he did not open his mouth; he was led like a lamb to the slaughter...",
      "nt_ref": "Matthew 27:12-14, Acts 8:32",
      "nt_fulfillment": "...he gave no answer... Jesus made no reply... “He was led like a sheep to the slaughter...”"
    },
    {
      "ot_ref": "Isaiah 53:8",
      "ot_prophecy": "...he was cut off from the land of the living; for the transgression of my people he was punished.",
      "nt_ref": "Acts 8:33",
      "nt_fulfillment": "In his humiliation he was deprived of justice... For his life was taken from the earth.”"
    },
    {
      "ot_ref": "Isaiah 53:9",
      "ot_prophecy": "...with the rich in his death, though he had done no violence...",
      "nt_ref": "Matthew 27:57-60, 1 Peter 2:22",
      "nt_fulfillment": "...there came a rich man... Joseph... placed it in his own new tomb... “He committed no sin...”"
    },
    {
      "ot_ref": "Isaiah 53:10",
      "ot_prophecy": "...though the LORD makes his life an offering for sin, he will see his offspring...",
      "nt_ref": "John 12:24, Hebrews 2:10",
      "nt_fulfillment": "...if it dies, it produces many seeds... In bringing many sons and daughters to glory, it was fitting that God... should make the pioneer of their salvation perfect through what he suffered."
    },
    {
      "ot_ref": "Isaiah 53:11",
      "ot_prophecy": "...my righteous servant will justify many, and he will bear their iniquities.",
      "nt_ref": "Romans 5:18-19",
      "nt_fulfillment": "...so also one righteous act resulted in justification and life for all people... so also through the obedience of the one man the many will be made righteous."
    },
    {
      "ot_ref": "Isaiah 53:12",
      "ot_prophecy": "...was numbered with the transgressors... bore the sin of many, and made intercession for the transgressors.",
      "nt_ref": "Mark 15:27-28, Luke 23:34, Hebrews 7:25",
      "nt_fulfillment": "They crucified two rebels with him... [“He was numbered with the transgressors.”]... Jesus said, “Father, forgive them...”... he always lives to intercede for them."
    },
    {
      "ot_ref": "Isaiah 55:3",
      "ot_prophecy": "...I will make an everlasting covenant with you, my faithful love promised to David.",
      "nt_ref": "Acts 13:34",
      "nt_fulfillment": "‘I will give you the holy and sure blessings promised to David.’"
    },
    {
      "ot_ref": "Isaiah 55:4",
      "ot_prophecy": "See, I have made him a witness to the peoples, a ruler and commander of the peoples.",
      "nt_ref": "John 18:37, Revelation 1:5",
      "nt_fulfillment": "“You say that I am a king. In fact, the reason I was born and came into the world is to testify to the truth.” ... and from Jesus Christ, who is the faithful witness, the firstborn from the dead, and the ruler of the kings of the earth."
    },
    {
      "ot_ref": "Isaiah 59:16",
      "ot_prophecy": "He saw that there was no one, he was appalled that there was no one to intervene; so his own arm achieved salvation for him, and his own righteousness sustained him.",
      "nt_ref": "John 16:32, Hebrews 7:25",
      "nt_fulfillment": "“A time is coming... when you will be scattered... You will leave me all alone. Yet I am not alone, for my Father is with me.”... Therefore he is able to save completely those who come to God through him, because he always lives to intercede for them."
    },
    {
      "ot_ref": "Isaiah 61:1-2",
      "ot_prophecy": "The Spirit of the Sovereign LORD is on me... to proclaim good news to the poor... to proclaim the year of the LORD’s favor...",
      "nt_ref": "Luke 4:18-19, 21",
      "nt_fulfillment": "“The Spirit of the Lord is on me... to proclaim good news... to proclaim the year of the Lord’s favor.”... “Today this scripture is fulfilled...”"
    },
    {
      "ot_ref": "Jeremiah 23:5-6",
      "ot_prophecy": "I will raise up for David a righteous Branch... This is the name by which he will be called: The LORD Our Righteous Savior.",
      "nt_ref": "Luke 1:32-33, 1 Corinthians 1:30",
      "nt_fulfillment": "The Lord God will give him the throne of his father David... Christ Jesus... has become for us... our righteousness..."
    },
    {
      "ot_ref": "Jeremiah 31:15",
      "ot_prophecy": "A voice is heard in Ramah... Rachel weeping for her children...",
      "nt_ref": "Matthew 2:16-18",
      "nt_fulfillment": "...gave orders to kill all the boys in Bethlehem... Then what was said through... Jeremiah was fulfilled: “A voice is heard in Ramah, weeping...”"
    },
    {
      "ot_ref": "Jeremiah 31:31-34",
      "ot_prophecy": "...I will make a new covenant... I will put my law in their minds... I will forgive their wickedness...",
      "nt_ref": "Matthew 26:28, Hebrews 8:8-12, 10:16-17",
      "nt_fulfillment": "This is my blood of the covenant... for the forgiveness of sins... ‘...I will make a new covenant... I will put my laws in their minds... Their sins... I will remember no more.’”"
    },
    {
      "ot_ref": "Daniel 2:34-35, 44-45",
      "ot_prophecy": "...a rock was cut out, but not by human hands... it struck the statue... the God of heaven will set up a kingdom that will never be destroyed...",
      "nt_ref": "Acts 4:11, 1 Peter 2:4-6",
      "nt_fulfillment": "Jesus is ‘the stone you builders rejected...’... As you come to him, the living Stone—rejected by humans but chosen by God... “See, I lay a stone in Zion, a chosen and precious cornerstone...”"
    },
    {
      "ot_ref": "Daniel 7:13-14",
      "ot_prophecy": "...one like a son of man, coming with the clouds of heaven... He was given authority... His dominion is an everlasting dominion...",
      "nt_ref": "Matthew 26:64, Mark 14:62, Revelation 1:7",
      "nt_fulfillment": "...you will see the Son of Man sitting at the right hand... and coming on the clouds of heaven.”... “I am,” said Jesus. “And you will see the Son of Man... coming on the clouds of heaven.”... “Look, he is coming with the clouds...”"
    },
    {
      "ot_ref": "Daniel 9:24",
      "ot_prophecy": "...to finish transgression, to put an end to sin, to atone for wickedness...",
      "nt_ref": "Romans 5:8, Hebrews 9:12, 26",
      "nt_fulfillment": "...Christ died for us... he entered the Most Holy Place once for all by his own blood... he has appeared once for all... to do away with sin by the sacrifice of himself."
    },
    {
      "ot_ref": "Daniel 9:25",
      "ot_prophecy": "...From the time the word goes out to restore... Jerusalem until the Anointed One... comes...",
      "nt_ref": "Luke 2:1-2, 11, Galatians 4:4",
      "nt_fulfillment": "Caesar Augustus issued a decree... a Savior has been born to you; he is the Messiah, the Lord... But when the set time had fully come, God sent his Son..."
    },
    {
      "ot_ref": "Daniel 9:26a",
      "ot_prophecy": "...the Anointed One will be put to death...",
      "nt_ref": "Mark 9:12, John 19:18",
      "nt_fulfillment": "...Son of Man must suffer much and be rejected?”... There they crucified him..."
    },
    {
      "ot_ref": "Hosea 6:2",
      "ot_prophecy": "After two days he will revive us; on the third day he will restore us, that we may live in his presence.",
      "nt_ref": "1 Corinthians 15:4, Luke 24:46",
      "nt_fulfillment": "...that he was buried, that he was raised on the third day according to the Scriptures... He told them, “This is what is written: The Messiah will suffer and rise from the dead on the third day,"
    },
    {
      "ot_ref": "Hosea 11:1",
      "ot_prophecy": "...out of Egypt I called my son.",
      "nt_ref": "Matthew 2:14-15",
      "nt_fulfillment": "...left for Egypt... And so was fulfilled... “Out of Egypt I called my son.”"
    },
    {
      "ot_ref": "Joel 2:28-29",
      "ot_prophecy": "...I will pour out my Spirit on all people...",
      "nt_ref": "Acts 2:16-18, 33",
      "nt_fulfillment": "...this is what was spoken by... Joel: ‘...I will pour out my Spirit on all people...'... he has received from the Father the promised Holy Spirit and has poured out what you now see and hear."
    },
    {
      "ot_ref": "Amos 8:9",
      "ot_prophecy": "“In that day,” declares the Sovereign LORD, “I will make the sun go down at noon and darken the earth in broad daylight.",
      "nt_ref": "Matthew 27:45",
      "nt_fulfillment": "From noon until three in the afternoon darkness came over all the land."
    },
    {
      "ot_ref": "Jonah 1:17",
      "ot_prophecy": "Now the LORD provided a huge fish to swallow Jonah, and Jonah was in the belly of the fish three days and three nights.",
      "nt_ref": "Matthew 12:40",
      "nt_fulfillment": "(Jesus applies the type) For as Jonah was three days and three nights in the belly of a huge fish, so the Son of Man will be three days and three nights in the heart of the earth."
    },
    {
      "ot_ref": "Micah 5:2",
      "ot_prophecy": "But you, Bethlehem Ephrathah... out of you will come for me one who will be ruler over Israel...",
      "nt_ref": "Matthew 2:1, 5-6, Luke 2:4-7",
      "nt_fulfillment": "After Jesus was born in Bethlehem... ‘But you, Bethlehem... out of you will come a ruler...’... Joseph also went... to Bethlehem... she gave birth..."
    },
    {
      "ot_ref": "Habakkuk 1:12",
      "ot_prophecy": "LORD, are you not from everlasting? My God, my Holy One, you will never die.",
      "nt_ref": "Revelation 1:8, 17-18",
      "nt_fulfillment": "“I am the Alpha and the Omega,” says the Lord God, “who is, and who was, and who is to come, the Almighty.”... “Do not be afraid. I am the First and the Last. I am the Living One; I was dead, and now look, I am alive for ever and ever!”"
    },
    {
      "ot_ref": "Zechariah 6:12-13",
      "ot_prophecy": "‘Here is the man whose name is the Branch... And he will be a priest on his throne.'",
      "nt_ref": "Hebrews 8:1, 6:20",
      "nt_fulfillment": "We do have such a high priest, who sat down at the right hand of the throne... He has become a high priest forever, in the order of Melchizedek."
    },
    {
      "ot_ref": "Zechariah 9:9",
      "ot_prophecy": "See, your king comes to you, righteous and victorious, lowly and riding on a donkey...",
      "nt_ref": "Matthew 21:4-5, 9",
      "nt_fulfillment": "This took place to fulfill... “Say to Daughter Zion, ‘See, your king comes to you, gentle and riding on a donkey...’”... “Hosanna to the Son of David!”..."
    },
    {
      "ot_ref": "Zechariah 11:12-13",
      "ot_prophecy": "So they paid me thirty pieces of silver. And the LORD said to me, “Throw it to the potter”...",
      "nt_ref": "Matthew 26:14-15, 27:3-7",
      "nt_fulfillment": "...thirty pieces of silver... Judas threw the money... they decided to use the money to buy the potter’s field..."
    },
    {
      "ot_ref": "Zechariah 12:10",
      "ot_prophecy": "They will look on me, the one they have pierced, and they will mourn for him...",
      "nt_ref": "John 19:34, 37, Revelation 1:7",
      "nt_fulfillment": "...one of the soldiers pierced Jesus’ side... “They will look on the one they have pierced.”... “every eye will see him, even those who pierced him”..."
    },
    {
      "ot_ref": "Zechariah 13:1",
      "ot_prophecy": "On that day a fountain will be opened to the house of David and the inhabitants of Jerusalem, to cleanse them from sin and impurity.",
      "nt_ref": "1 John 1:7, Revelation 7:14",
      "nt_fulfillment": "...and the blood of Jesus, his Son, purifies us from all sin... “These are they who have come out of the great tribulation; they have washed their robes and made them white in the blood of the Lamb.\""
    },
    {
      "ot_ref": "Zechariah 13:7",
      "ot_prophecy": "“Strike the shepherd, and the sheep will be scattered...\"",
      "nt_ref": "Matthew 26:31, 56",
      "nt_fulfillment": "‘I will strike the shepherd, and the sheep of the flock will be scattered.’”... Then all the disciples deserted him and fled."
    },
    {
      "ot_ref": "Zechariah 14:4",
      "ot_prophecy": "On that day his feet will stand on the Mount of Olives, east of Jerusalem, and the Mount of Olives will be split in two from east to west...",
      "nt_ref": "Acts 1:11-12",
      "nt_fulfillment": "(Ascension location points to return location) “Men of Galilee,” they said, “why do you stand here looking into the sky? This same Jesus, who has been taken from you into heaven, will come back in the same way you have seen him go into heaven.” Then the apostles returned to Jerusalem from the hill called the Mount of Olives..."
    },
    {
      "ot_ref": "Malachi 3:1",
      "ot_prophecy": "“I will send my messenger, who will prepare the way before me. Then suddenly the Lord you are seeking will come to his temple...\"",
      "nt_ref": "Matthew 11:10, Mark 1:2, Luke 7:27",
      "nt_fulfillment": "‘I will send my messenger ahead of you, who will prepare your way before you.’"
    },
    {
      "ot_ref": "Malachi 4:5-6",
      "ot_prophecy": "See, I will send the prophet Elijah to you before that great and dreadful day of the LORD comes...",
      "nt_ref": "Matthew 11:13-14, 17:11-13, Luke 1:17",
      "nt_fulfillment": "...if you are willing to accept it, he [John the Baptist] is the Elijah who was to come... Elijah has already come... talking to them about John the Baptist... And he will go on before the Lord, in the spirit and power of Elijah..."
    }
  ]